daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
/**
 * @file wiring_irq.cpp
 * @author Daniel Starke
 * @copyright Copyright 2020-2022 Daniel Starke
 * @date 2020-11-13
 * @version 2022-03-11
 */
#include "Arduino.h"
#include "wiring_irq.h"


#if !defined(STM32CUBEDUINO_DISABLE_TIMER) || !defined(STM32CUBEDUINO_DISABLE_PWM)
#define SCD_ENABLE_TIMER
#else
#undef SCD_ENABLE_TIMER
#endif


#ifdef __HAL_GET_PENDING_IT /* STM32F0 specific interrupt line handling. */
#define ifIsPendingIrqForADC() if (__HAL_GET_PENDING_IT(HAL_ITLINE_ADC) != RESET)
#define ifIsPendingIrqForCAN() if (__HAL_GET_PENDING_IT(HAL_ITLINE_CAN) != RESET)
#define ifIsPendingIrqForCEC() if (__HAL_GET_PENDING_IT(HAL_ITLINE_CEC) != RESET)
#define ifIsPendingIrqForCLK_CTRL() if (__HAL_GET_PENDING_IT(HAL_ITLINE_CLK_CTRL) != RESET)
#define ifIsPendingIrqForCOMP1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_COMP1) != RESET)
#define ifIsPendingIrqForCOMP2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_COMP2) != RESET)
#define ifIsPendingIrqForCRS() if (__HAL_GET_PENDING_IT(HAL_ITLINE_CRS) != RESET)
#define ifIsPendingIrqForDAC() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DAC) != RESET)
#define ifIsPendingIrqForDMA1_CH1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH1) != RESET)
#define ifIsPendingIrqForDMA1_CH2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH2) != RESET)
#define ifIsPendingIrqForDMA1_CH3() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH3) != RESET)
#define ifIsPendingIrqForDMA1_CH4() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH4) != RESET)
#define ifIsPendingIrqForDMA1_CH5() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH5) != RESET)
#define ifIsPendingIrqForDMA1_CH6() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH6) != RESET)
#define ifIsPendingIrqForDMA1_CH7() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA1_CH7) != RESET)
#define ifIsPendingIrqForDMA2_CH1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA2_CH1) != RESET)
#define ifIsPendingIrqForDMA2_CH2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA2_CH2) != RESET)
#define ifIsPendingIrqForDMA2_CH3() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA2_CH3) != RESET)
#define ifIsPendingIrqForDMA2_CH4() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA2_CH4) != RESET)
#define ifIsPendingIrqForDMA2_CH5() if (__HAL_GET_PENDING_IT(HAL_ITLINE_DMA2_CH5) != RESET)
#define ifIsPendingIrqForEXTI0() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI0) != RESET)
#define ifIsPendingIrqForEXTI1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI1) != RESET)
#define ifIsPendingIrqForEXTI2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI2) != RESET)
#define ifIsPendingIrqForEXTI3() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI3) != RESET)
#define ifIsPendingIrqForEXTI4() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI4) != RESET)
#define ifIsPendingIrqForEXTI5() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI5) != RESET)
#define ifIsPendingIrqForEXTI6() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI6) != RESET)
#define ifIsPendingIrqForEXTI7() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI7) != RESET)
#define ifIsPendingIrqForEXTI8() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI8) != RESET)
#define ifIsPendingIrqForEXTI9() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI9) != RESET)
#define ifIsPendingIrqForEXTI10() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI10) != RESET)
#define ifIsPendingIrqForEXTI11() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI11) != RESET)
#define ifIsPendingIrqForEXTI12() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI12) != RESET)
#define ifIsPendingIrqForEXTI13() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI13) != RESET)
#define ifIsPendingIrqForEXTI14() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI14) != RESET)
#define ifIsPendingIrqForEXTI15() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EXTI15) != RESET)
#define ifIsPendingIrqForFLASH() if (__HAL_GET_PENDING_IT(HAL_ITLINE_FLASH_ITF) != RESET)
#define ifIsPendingIrqForI2C1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_I2C1) != RESET)
#define ifIsPendingIrqForI2C2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_I2C2) != RESET)
#ifdef HAL_ITLINE_PVDOUT
#define ifIsPendingIrqForPWR() if (__HAL_GET_PENDING_IT(HAL_ITLINE_VDDIO2) != RESET || __HAL_GET_PENDING_IT(HAL_ITLINE_PVDOUT))
#else /* not HAL_ITLINE_PVDOUT */
#define ifIsPendingIrqForPWR() if (__HAL_GET_PENDING_IT(HAL_ITLINE_VDDIO2) != RESET)
#endif /* not HAL_ITLINE_PVDOUT */
#define ifIsPendingIrqForRTC() if (__HAL_GET_PENDING_IT(HAL_ITLINE_RTC_WAKEUP) != RESET || __HAL_GET_PENDING_IT(HAL_ITLINE_RTC_TSTAMP) != RESET || __HAL_GET_PENDING_IT(HAL_ITLINE_RTC_ALRA) != RESET)
#define ifIsPendingIrqForSPI1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_SPI1) != RESET)
#define ifIsPendingIrqForSPI2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_SPI2) != RESET)
#define ifIsPendingIrqForTIM1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM1) != RESET)
#define ifIsPendingIrqForTIM2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM2) != RESET)
#define ifIsPendingIrqForTIM3() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM3) != RESET)
#define ifIsPendingIrqForTIM6() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM6) != RESET)
#define ifIsPendingIrqForTIM7() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM7) != RESET)
#define ifIsPendingIrqForTIM14() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM14) != RESET)
#define ifIsPendingIrqForTIM15() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM15) != RESET)
#define ifIsPendingIrqForTIM16() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM16) != RESET)
#define ifIsPendingIrqForTIM17() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TIM17) != RESET)
#define ifIsPendingIrqForTSC() if (__HAL_GET_PENDING_IT(HAL_ITLINE_TSC_EOA) != RESET || __HAL_GET_PENDING_IT(HAL_ITLINE_TSC_MCE) != RESET)
#define ifIsPendingIrqForUSART1() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART1) != RESET)
#define ifIsPendingIrqForUSART2() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART2) != RESET)
#define ifIsPendingIrqForUSART3() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART3) != RESET)
#define ifIsPendingIrqForUSART4() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART4) != RESET)
#define ifIsPendingIrqForUSART5() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART5) != RESET)
#define ifIsPendingIrqForUSART6() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART6) != RESET)
#define ifIsPendingIrqForUSART7() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART7) != RESET)
#define ifIsPendingIrqForUSART8() if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART8) != RESET)
#define ifIsPendingIrqForWWDG() if (__HAL_GET_PENDING_IT(HAL_ITLINE_EWDG) != RESET)
#else /* not __HAL_GET_PENDING_IT */
#define ifIsPendingIrqForADC()
#define ifIsPendingIrqForCAN()
#define ifIsPendingIrqForCEC()
#define ifIsPendingIrqForCLK_CTRL()
#define ifIsPendingIrqForCOMP1()
#define ifIsPendingIrqForCOMP2()
#define ifIsPendingIrqForCRS()
#define ifIsPendingIrqForDAC()
#define ifIsPendingIrqForDMA1_CH1()
#define ifIsPendingIrqForDMA1_CH2()
#define ifIsPendingIrqForDMA1_CH3()
#define ifIsPendingIrqForDMA1_CH4()
#define ifIsPendingIrqForDMA1_CH5()
#define ifIsPendingIrqForDMA1_CH6()
#define ifIsPendingIrqForDMA1_CH7()
#define ifIsPendingIrqForDMA2_CH1()
#define ifIsPendingIrqForDMA2_CH2()
#define ifIsPendingIrqForDMA2_CH3()
#define ifIsPendingIrqForDMA2_CH4()
#define ifIsPendingIrqForDMA2_CH5()
#define ifIsPendingIrqForEXTI0()
#define ifIsPendingIrqForEXTI1()
#define ifIsPendingIrqForEXTI2()
#define ifIsPendingIrqForEXTI3()
#define ifIsPendingIrqForEXTI4()
#define ifIsPendingIrqForEXTI5()
#define ifIsPendingIrqForEXTI6()
#define ifIsPendingIrqForEXTI7()
#define ifIsPendingIrqForEXTI8()
#define ifIsPendingIrqForEXTI9()
#define ifIsPendingIrqForEXTI10()
#define ifIsPendingIrqForEXTI11()
#define ifIsPendingIrqForEXTI12()
#define ifIsPendingIrqForEXTI13()
#define ifIsPendingIrqForEXTI14()
#define ifIsPendingIrqForEXTI15()
#define ifIsPendingIrqForFLASH()
#define ifIsPendingIrqForI2C1()
#define ifIsPendingIrqForI2C2()
#define ifIsPendingIrqForPWR()
#define ifIsPendingIrqForRTC()
#define ifIsPendingIrqForSPI1()
#define ifIsPendingIrqForSPI2()
#define ifIsPendingIrqForTIM1()
#define ifIsPendingIrqForTIM2()
#define ifIsPendingIrqForTIM3()
#define ifIsPendingIrqForTIM6()
#define ifIsPendingIrqForTIM7()
#define ifIsPendingIrqForTIM14()
#define ifIsPendingIrqForTIM15()
#define ifIsPendingIrqForTIM16()
#define ifIsPendingIrqForTIM17()
#define ifIsPendingIrqForTSC()
#define ifIsPendingIrqForUSART1()
#define ifIsPendingIrqForUSART2()
#define ifIsPendingIrqForUSART3()
#define ifIsPendingIrqForUSART4()
#define ifIsPendingIrqForUSART5()
#define ifIsPendingIrqForUSART6()
#define ifIsPendingIrqForUSART7()
#define ifIsPendingIrqForUSART8()
#define ifIsPendingIrqForWWDG()
#endif /* not __HAL_GET_PENDING_IT */


