daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
/* Ensure that there are no macro re-mappings enabled. */
#undef ADC_IRQHandler
#undef ADC1_COMP_IRQHandler
#undef ADC1_IRQHandler
#undef ADC1_2_IRQHandler
#undef ADC2_IRQHandler
#undef ADC3_IRQHandler
#undef ADC4_IRQHandler
#undef ADC5_IRQHandler

#undef AES_IRQHandler
#undef AES_RNG_IRQHandler
#undef AES_RNG_LPUART1_IRQHandler
#undef AES1_IRQHandler
#undef AES2_IRQHandler

#undef BDMA_Channel0_IRQHandler
#undef BDMA_Channel1_IRQHandler
#undef BDMA_Channel2_IRQHandler
#undef BDMA_Channel3_IRQHandler
#undef BDMA_Channel4_IRQHandler
#undef BDMA_Channel5_IRQHandler
#undef BDMA_Channel6_IRQHandler
#undef BDMA_Channel7_IRQHandler
#undef BDMA1_IRQHandler
#undef BDMA2_Channel0_IRQHandler
#undef BDMA2_Channel1_IRQHandler
#undef BDMA2_Channel2_IRQHandler
#undef BDMA2_Channel3_IRQHandler
#undef BDMA2_Channel4_IRQHandler
#undef BDMA2_Channel5_IRQHandler
#undef BDMA2_Channel6_IRQHandler
#undef BDMA2_Channel7_IRQHandler

#undef CAN_RX0_IRQHandler
#undef CAN_RX1_IRQHandler
#undef CAN_SCE_IRQHandler
#undef CAN_TX_IRQHandler
#undef CAN1_RX0_IRQHandler
#undef CAN1_RX1_IRQHandler
#undef CAN1_SCE_IRQHandler
#undef CAN1_TX_IRQHandler
#undef CAN2_RX0_IRQHandler
#undef CAN2_RX1_IRQHandler
#undef CAN2_SCE_IRQHandler
#undef CAN2_TX_IRQHandler
#undef CAN3_RX0_IRQHandler
#undef CAN3_RX1_IRQHandler
#undef CAN3_SCE_IRQHandler
#undef CAN3_TX_IRQHandler

#undef CEC_CAN_IRQHandler
#undef CEC_IRQHandler

#undef COMP_ACQ_IRQHandler
#undef COMP_IRQHandler
#undef COMP1_2_IRQHandler
#undef COMP1_2_3_IRQHandler
#undef COMP2_IRQHandler
#undef COMP4_IRQHandler
#undef COMP4_5_6_IRQHandler
#undef COMP4_6_IRQHandler
#undef COMP7_IRQHandler

#undef CORDIC_IRQHandler

#undef CRS_IRQHandler

#undef CRYP_IRQHandler
#undef CRYP1_IRQHandler
#undef CRYP2_IRQHandler

#undef DAC_IRQHandler
#undef DAC2_IRQHandler

#undef DCMI_IRQHandler
#undef DCMI_PSSI_IRQHandler

#undef DFSDM1_FLT0_IRQHandler
#undef DFSDM1_FLT1_IRQHandler
#undef DFSDM1_FLT2_IRQHandler
#undef DFSDM1_FLT3_IRQHandler
#undef DFSDM1_FLT4_IRQHandler
#undef DFSDM1_FLT5_IRQHandler
#undef DFSDM1_FLT6_IRQHandler
#undef DFSDM1_FLT7_IRQHandler
#undef DFSDM2_FLT0_IRQHandler
#undef DFSDM2_FLT1_IRQHandler
#undef DFSDM2_FLT2_IRQHandler
#undef DFSDM2_FLT3_IRQHandler
#undef DFSDM2_IRQHandler

#undef DMAMUX_OVR_IRQHandler
#undef DMAMUX1_IRQHandler
#undef DMAMUX1_OVR_IRQHandler
#undef DMAMUX1_S_IRQHandler
#undef DMAMUX2_OVR_IRQHandler

#undef DMA1_Channel1_IRQHandler
#undef DMA1_Channel2_IRQHandler
#undef DMA1_Channel2_3_IRQHandler
#undef DMA1_Channel3_IRQHandler
#undef DMA1_Channel4_IRQHandler
#undef DMA1_Channel4_5_IRQHandler
#undef DMA1_Channel4_5_6_7_IRQHandler
#undef DMA1_Channel5_IRQHandler
#undef DMA1_Channel6_IRQHandler
#undef DMA1_Channel7_IRQHandler
#undef DMA1_Channel8_IRQHandler
#undef DMA1_Ch1_IRQHandler
#undef DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler
#undef DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler
#undef DMA1_Ch4_7_DMAMUX1_OVR_IRQHandler
#undef DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#undef DMA1_Stream0_IRQHandler
#undef DMA1_Stream1_IRQHandler
#undef DMA1_Stream2_IRQHandler
#undef DMA1_Stream3_IRQHandler
#undef DMA1_Stream4_IRQHandler
#undef DMA1_Stream5_IRQHandler
#undef DMA1_Stream6_IRQHandler
#undef DMA1_Stream7_IRQHandler
#undef DMA2D_IRQHandler
#undef DMA2_Channel1_IRQHandler
#undef DMA2_Channel2_IRQHandler
#undef DMA2_Channel3_IRQHandler
#undef DMA2_Channel4_IRQHandler
#undef DMA2_Channel4_5_IRQHandler
#undef DMA2_Channel5_IRQHandler
#undef DMA2_Channel6_IRQHandler
#undef DMA2_Channel7_IRQHandler
#undef DMA2_Channel8_IRQHandler
#undef DMA2_Stream0_IRQHandler
#undef DMA2_Stream1_IRQHandler
#undef DMA2_Stream2_IRQHandler
#undef DMA2_Stream3_IRQHandler
#undef DMA2_Stream4_IRQHandler
#undef DMA2_Stream5_IRQHandler
#undef DMA2_Stream6_IRQHandler
#undef DMA2_Stream7_IRQHandler

#undef DSI_IRQHandler

#undef DTS_IRQHandler

#undef ETH_IRQHandler
#undef ETH_WKUP_IRQHandler
#undef ETH1_IRQHandler
#undef ETH1_LPI_IRQHandler
#undef ETH1_WKUP_IRQHandler

#undef EXTI0_IRQHandler
#undef EXTI0_1_IRQHandler
#undef EXTI1_IRQHandler
#undef EXTI2_IRQHandler
#undef EXTI2_TSC_IRQHandler
#undef EXTI2_3_IRQHandler
#undef EXTI3_IRQHandler
#undef EXTI4_IRQHandler
#undef EXTI4_15_IRQHandler
#undef EXTI5_IRQHandler
#undef EXTI6_IRQHandler
#undef EXTI7_IRQHandler
#undef EXTI8_IRQHandler
#undef EXTI9_IRQHandler
#undef EXTI9_5_IRQHandler
#undef EXTI10_IRQHandler
#undef EXTI11_IRQHandler
#undef EXTI12_IRQHandler
#undef EXTI13_IRQHandler
#undef EXTI14_IRQHandler
#undef EXTI15_IRQHandler
#undef EXTI15_10_IRQHandler

#undef FDCAN_CAL_IRQHandler
#undef FDCAN1_IT0_IRQHandler
#undef FDCAN1_IT1_IRQHandler
#undef FDCAN2_IT0_IRQHandler
#undef FDCAN2_IT1_IRQHandler
#undef FDCAN3_IT0_IRQHandler
#undef FDCAN3_IT1_IRQHandler

#undef FLASH_IRQHandler
#undef FLASH_S_IRQHandler

#undef FMAC_IRQHandler

#undef FMC_IRQHandler

#undef FMPI2C1_ER_IRQHandler
#undef FMPI2C1_EV_IRQHandler

#undef FSMC_IRQHandler

#undef GFXMMU_IRQHandler

#undef GPU_IRQHandler

#undef GTZC_IRQHandler

#undef HASH_CRS_IRQHandler
#undef HASH_IRQHandler
#undef HASH_RNG_IRQHandler
#undef HASH1_IRQHandler
#undef HASH2_IRQHandler

#undef HRTIM1_FLT_IRQHandler
#undef HRTIM1_Master_IRQHandler
#undef HRTIM1_TIMA_IRQHandler
#undef HRTIM1_TIMB_IRQHandler
#undef HRTIM1_TIMC_IRQHandler
#undef HRTIM1_TIMD_IRQHandler
#undef HRTIM1_TIME_IRQHandler
#undef HRTIM1_TIMF_IRQHandler

#undef HSEM_IRQHandler

#undef ICACHE_IRQHandler

#undef IPCC_C1_RX_IRQHandler
#undef IPCC_C1_TX_IRQHandler
#undef IPCC_RX0_IRQHandler
#undef IPCC_RX1_IRQHandler
#undef IPCC_TX0_IRQHandler
#undef IPCC_TX1_IRQHandler

#undef I2C1_ER_IRQHandler
#undef I2C1_EV_IRQHandler
#undef I2C1_IRQHandler
#undef I2C2_ER_IRQHandler
#undef I2C2_EV_IRQHandler
#undef I2C2_IRQHandler
#undef I2C3_ER_IRQHandler
#undef I2C3_EV_IRQHandler
#undef I2C3_IRQHandler
#undef I2C4_ER_IRQHandler
#undef I2C4_EV_IRQHandler
#undef I2C5_ER_IRQHandler
#undef I2C5_EV_IRQHandler
#undef I2C6_ER_IRQHandler
#undef I2C6_EV_IRQHandler

#undef JPEG_IRQHandler

#undef LCD_IRQHandler

#undef LPTIM1_IRQHandler
#undef LPTIM2_IRQHandler
#undef LPTIM3_IRQHandler
#undef LPTIM4_IRQHandler
#undef LPTIM5_IRQHandler

#undef LPUART1_IRQHandler

