daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
#undef LTDC_ER_IRQHandler
#undef LTDC_IRQHandler

#undef MDIOS_IRQHandler
#undef MDIOS_WKUP_IRQHandler

#undef MDMA_IRQHandler

#undef OCTOSPI1_IRQHandler
#undef OCTOSPI2_IRQHandler

#undef OTFDEC1_IRQHandler
#undef OTFDEC2_IRQHandler

#undef OTG_FS_EP1_IN_IRQHandler
#undef OTG_FS_EP1_OUT_IRQHandler
#undef OTG_FS_IRQHandler
#undef OTG_FS_WKUP_IRQHandler
#undef OTG_HS_EP1_IN_IRQHandler
#undef OTG_HS_EP1_OUT_IRQHandler
#undef OTG_HS_IRQHandler
#undef OTG_HS_WKUP_IRQHandler
#undef OTG_IRQHandler

#undef PKA_IRQHandler

#undef PVD_AVD_IRQHandler

#undef QUADSPI_IRQHandler

#undef RCC_CRS_IRQHandler
#undef RCC_IRQHandler
#undef RCC_S_IRQHandler
#undef RCC_WAKEUP_IRQHandler

#undef RNG_IRQHandler
#undef RNG_LPUART1_IRQHandler
#undef RNG1_IRQHandler
#undef RNG2_IRQHandler

#undef RTC_Alarm_IRQHandler
#undef RTC_IRQHandler
#undef RTC_S_IRQHandler
#undef RTC_TAMP_IRQHandler
#undef RTC_TAMP_LSECSS_IRQHandler
#undef RTC_TAMP_STAMP_CSS_LSE_IRQHandler
#undef RTC_TIMESTAMP_IRQHandler
#undef RTC_WKUP_ALARM_IRQHandler
#undef RTC_WKUP_IRQHandler

#undef SAI1_IRQHandler
#undef SAI2_IRQHandler
#undef SAI3_IRQHandler
#undef SAI4_IRQHandler

#undef SDADC1_IRQHandler
#undef SDADC2_IRQHandler
#undef SDADC3_IRQHandler

#undef SDIO_IRQHandler

#undef SDMMC1_IRQHandler
#undef SDMMC2_IRQHandler
#undef SDMMC3_IRQHandler

#undef SPDIF_RX_IRQHandler

#undef SPI1_IRQHandler
#undef SPI2_IRQHandler
#undef SPI3_IRQHandler
#undef SPI4_IRQHandler
#undef SPI5_IRQHandler
#undef SPI6_IRQHandler

#undef SWPMI1_IRQHandler

#undef TAMPER_IRQHandler
#undef TAMPER_STAMP_IRQHandler

#undef TAMP_IRQHandler
#undef TAMP_STAMP_IRQHandler
#undef TAMP_STAMP_LSECSS_IRQHandler
#undef TAMP_S_IRQHandler

#undef TEMP_IRQHandler

#undef TIM1_BRK_IRQHandler
#undef TIM1_BRK_TIM9_IRQHandler
#undef TIM1_BRK_TIM15_IRQHandler
#undef TIM1_BRK_UP_TRG_COM_IRQHandler
#undef TIM1_CC_IRQHandler
#undef TIM1_TRG_COM_IRQHandler
#undef TIM1_TRG_COM_TIM11_IRQHandler
#undef TIM1_TRG_COM_TIM17_IRQHandler
#undef TIM1_UP_IRQHandler
#undef TIM1_UP_TIM10_IRQHandler
#undef TIM1_UP_TIM16_IRQHandler
#undef TIM2_IRQHandler
#undef TIM3_IRQHandler
#undef TIM4_IRQHandler
#undef TIM5_IRQHandler
#undef TIM6_DAC_IRQHandler
#undef TIM6_DAC_LPTIM1_IRQHandler
#undef TIM6_DAC1_IRQHandler
#undef TIM6_IRQHandler
#undef TIM7_DAC_IRQHandler
#undef TIM7_DAC2_IRQHandler
#undef TIM7_IRQHandler
#undef TIM7_LPTIM2_IRQHandler
#undef TIM8_BRK_IRQHandler
#undef TIM8_BRK_TIM12_IRQHandler
#undef TIM8_CC_IRQHandler
#undef TIM8_TRG_COM_IRQHandler
#undef TIM8_TRG_COM_TIM14_IRQHandler
#undef TIM8_UP_IRQHandler
#undef TIM8_UP_TIM13_IRQHandler
#undef TIM9_IRQHandler
#undef TIM10_IRQHandler
#undef TIM11_IRQHandler
#undef TIM12_IRQHandler
#undef TIM13_IRQHandler
#undef TIM14_IRQHandler
#undef TIM15_IRQHandler
#undef TIM16_IRQHandler
#undef TIM17_IRQHandler
#undef TIM18_DAC2_IRQHandler
#undef TIM19_IRQHandler
#undef TIM20_BRK_IRQHandler
#undef TIM20_CC_IRQHandler
#undef TIM20_TRG_COM_IRQHandler
#undef TIM20_UP_IRQHandler
#undef TIM21_IRQHandler
#undef TIM22_IRQHandler
#undef TIM23_IRQHandler
#undef TIM24_IRQHandler

#undef TSC_IRQHandler

#undef UART4_IRQHandler
#undef UART5_IRQHandler
#undef UART7_IRQHandler
#undef UART8_IRQHandler
#undef UART9_IRQHandler
#undef UART10_IRQHandler

#undef UCPD1_IRQHandler
#undef UCPD1_2_IRQHandler

#undef USART1_IRQHandler
#undef USART2_IRQHandler
#undef USART3_IRQHandler
#undef USART3_4_IRQHandler
#undef USART3_4_LPUART1_IRQHandler
#undef USART3_6_IRQHandler
#undef USART3_8_IRQHandler
#undef USART4_5_IRQHandler
#undef USART6_IRQHandler
#undef USART10_IRQHandler

#undef USBH_EHCI_IRQHandler
#undef USBH_OHCI_IRQHandler

#undef USBWakeUp_IRQHandler
#undef USBWakeUp_RMP_IRQHandler

#undef USB_FS_IRQHandler
#undef USB_FS_WKUP_IRQHandler
#undef USB_HP_CAN_TX_IRQHandler
#undef USB_HP_CAN1_TX_IRQHandler
#undef USB_HP_IRQHandler
#undef USB_IRQHandler
#undef USB_LP_CAN_RX0_IRQHandler
#undef USB_LP_CAN1_RX0_IRQHandler
#undef USB_LP_IRQHandler

#undef WAKEUP_PIN_IRQHandler

#undef WWDG_IRQHandler
#undef WWDG_RST_IRQHandler
#undef WWDG1_IRQHandler


extern "C" {
extern const char _wiring_irq; /**< @see _wiring_irq_forced_linkage in Arduino.cpp */
const char _wiring_irq = 1;

/* Remapped IRQ routines. One per STM32 HAL instance. Empty fallback implementation is provided here. */
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForADC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForADC1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForADC2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForADC3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForADC4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForADC5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForAES(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForAES1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForAES2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH0(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA_CH7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH0(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA1_CH7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH0(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2_CH7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForBDMA2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCAN(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCAN1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCAN2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCAN3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCEC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCLK_CTRL(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCOMP7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCORDIC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCRS(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCRYP(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCRYP1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForCRYP2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDAC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDAC1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDAC2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDAC3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDAC4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDCMI(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDFSDM1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDFSDM2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH0(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA1_CH8(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2D(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH0(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDMA2_CH8(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDSIHOST(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForDTS(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForETH(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForETH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI0(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI8(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI9(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI10(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI11(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI12(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI13(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI14(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForEXTI15(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFDCAN1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFDCAN2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFDCAN3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFLASH(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFMAC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFMC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFMPI2C1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForFSMC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForGFXMMU(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForGPU(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForGTZC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHASH(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHASH1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHASH2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHDMI_CEC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHRTIM(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHRTIM1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForHSEM(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForICACHE(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForIPCC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2C1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2C2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2C3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2C4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2C5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2C6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2S1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2S2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2S3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2S4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2S5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForI2S6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForJPEG(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLCD(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLPTIM1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLPTIM2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLPTIM3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLPTIM4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLPTIM5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLPUART1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForLTDC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForMDIOS(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForMDMA(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForOCTOSPI1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForOCTOSPI2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForOTFDEC1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForOTFDEC2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForPKA(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForPSSI(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForPWR(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForQUADSPI(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForQUADSPI1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForRCC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForRNG(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForRNG1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForRNG2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForRTC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSAI1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSAI2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSAI3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSAI4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDADC1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDADC2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDADC3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDIO(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDMMC1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDMMC2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSDMMC3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPDIFRX(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPDIFRX1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPI1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPI2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPI3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPI4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPI5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSPI6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForSWPMI1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTAMP(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTEMPSENS(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM8(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM9(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM10(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM11(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM12(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM13(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM14(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM15(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM16(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM17(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM18(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM19(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM20(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM21(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM22(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM23(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTIM24(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForTSC(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUART4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUART5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUART7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUART8(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUART9(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUART10(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUCPD1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUCPD2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART3(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART4(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART5(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART6(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART7(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART8(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSART10(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSBH_HS1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSBH_HS2(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSB_OTG_FS(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSB_OTG_HS(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForUSB(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForWWDG(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForWWDG1(void) {}
__attribute__((weak)) void STM32CubeDuinoIrqHandlerForWWDG2(void) {}


#ifndef STM32CUBEDUINO_CUSTOM_IRQ_HANDLERS
/* STM32CubeDuinoIrqHandlerForXXX() wrapper implementation of all STM32 HAL IRQ handlers. Unused functions are removed by the linker. */
#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC1, ADC2 and ADC3 global interrupts */
void ADC_IRQHandler(void) {
	clearNvicIrqFor(ADC_IRQn);
	STM32CubeDuinoIrqHandlerForADC1();
	STM32CubeDuinoIrqHandlerForADC2();
	STM32CubeDuinoIrqHandlerForADC3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC1, COMP1 and COMP2 interrupts (COMP interrupts through EXTI lines 17 and 18) */
void ADC1_COMP_IRQHandler(void) {
	clearNvicIrqFor(ADC1_COMP_IRQn);
	ifIsPendingIrqForADC() STM32CubeDuinoIrqHandlerForADC();
	STM32CubeDuinoIrqHandlerForADC1();
	ifIsPendingIrqForCOMP1() STM32CubeDuinoIrqHandlerForCOMP1();
	ifIsPendingIrqForCOMP2() STM32CubeDuinoIrqHandlerForCOMP2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC1 global interrupt */
void ADC1_IRQHandler(void) {
	clearNvicIrqFor(ADC1_IRQn);
	ifIsPendingIrqForADC() STM32CubeDuinoIrqHandlerForADC();
	STM32CubeDuinoIrqHandlerForADC1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC1 and ADC2 global interrupts */
void ADC1_2_IRQHandler(void) {
	clearNvicIrqFor(ADC1_2_IRQn);
	STM32CubeDuinoIrqHandlerForADC1();
	STM32CubeDuinoIrqHandlerForADC2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC2 global interrupt */
void ADC2_IRQHandler(void) {
	clearNvicIrqFor(ADC2_IRQn);
	STM32CubeDuinoIrqHandlerForADC2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC3 global interrupt */
void ADC3_IRQHandler(void) {
	clearNvicIrqFor(ADC3_IRQn);
	STM32CubeDuinoIrqHandlerForADC3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC4 global interrupt */
void ADC4_IRQHandler(void) {
	clearNvicIrqFor(ADC4_IRQn);
	STM32CubeDuinoIrqHandlerForADC4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_ADC) && defined(ADC_SOFTWARE_START))
/** ADC5 global interrupt */
void ADC5_IRQHandler(void) {
	clearNvicIrqFor(ADC5_IRQn);
	STM32CubeDuinoIrqHandlerForADC5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or ADC_SOFTWARE_START */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** AES global interrupt */
void AES_IRQHandler(void) {
	clearNvicIrqFor(AES_IRQn);
	STM32CubeDuinoIrqHandlerForAES();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** AES and RNG interrupts */
void AES_RNG_IRQHandler(void) {
	clearNvicIrqFor(AES_RNG_IRQn);
	STM32CubeDuinoIrqHandlerForAES();
	STM32CubeDuinoIrqHandlerForRNG();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


