daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** AES, RNG and LPUART1 interrupts / LPUART1 wake-up interrupt through EXTI line 28 */
void AES_RNG_LPUART1_IRQHandler(void) {
	clearNvicIrqFor(AES_RNG_LPUART1_IRQn);
	STM32CubeDuinoIrqHandlerForAES();
	STM32CubeDuinoIrqHandlerForLPUART1();
	STM32CubeDuinoIrqHandlerForRNG();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** AES1 global interrupt */
void AES1_IRQHandler(void) {
	clearNvicIrqFor(AES1_IRQn);
	STM32CubeDuinoIrqHandlerForAES1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** AES2 global interrupt */
void AES2_IRQHandler(void) {
	clearNvicIrqFor(AES2_IRQn);
	STM32CubeDuinoIrqHandlerForAES2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel0 global interrupt */
void BDMA_Channel0_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel0_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH0();
	STM32CubeDuinoIrqHandlerForBDMA2_CH0();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel1 global interrupt */
void BDMA_Channel1_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel1_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH1();
	STM32CubeDuinoIrqHandlerForBDMA2_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel2 global interrupt */
void BDMA_Channel2_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel2_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH2();
	STM32CubeDuinoIrqHandlerForBDMA2_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel3 global interrupt */
void BDMA_Channel3_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel3_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH3();
	STM32CubeDuinoIrqHandlerForBDMA2_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel4 global interrupt */
void BDMA_Channel4_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel4_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH4();
	STM32CubeDuinoIrqHandlerForBDMA2_CH4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel5 global interrupt */
void BDMA_Channel5_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel5_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH5();
	STM32CubeDuinoIrqHandlerForBDMA2_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel6 global interrupt */
void BDMA_Channel6_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel6_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH6();
	STM32CubeDuinoIrqHandlerForBDMA2_CH6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA channel7 global interrupt */
void BDMA_Channel7_IRQHandler(void) {
	clearNvicIrqFor(BDMA_Channel7_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA_CH7();
	STM32CubeDuinoIrqHandlerForBDMA2_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA1 for DFSDM global interrupt */
void BDMA1_IRQHandler(void) {
	clearNvicIrqFor(BDMA1_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA1_CH0();
	STM32CubeDuinoIrqHandlerForBDMA1_CH1();
	STM32CubeDuinoIrqHandlerForBDMA1_CH2();
	STM32CubeDuinoIrqHandlerForBDMA1_CH3();
	STM32CubeDuinoIrqHandlerForBDMA1_CH4();
	STM32CubeDuinoIrqHandlerForBDMA1_CH5();
	STM32CubeDuinoIrqHandlerForBDMA1_CH6();
	STM32CubeDuinoIrqHandlerForBDMA1_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel0 global interrupt */
void BDMA2_Channel0_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel0_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH0();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel1 global interrupt */
void BDMA2_Channel1_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel1_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel2 global interrupt */
void BDMA2_Channel2_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel2_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel3 global interrupt */
void BDMA2_Channel3_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel3_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel4 global interrupt */
void BDMA2_Channel4_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel4_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel5 global interrupt */
void BDMA2_Channel5_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel5_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel6 global interrupt */
void BDMA2_Channel6_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel6_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** BDMA2 channel7 global interrupt */
void BDMA2_Channel7_IRQHandler(void) {
	clearNvicIrqFor(BDMA2_Channel7_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA2_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN RX0 interrupt */
void CAN_RX0_IRQHandler(void) {
	clearNvicIrqFor(CAN_RX0_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN RX1 interrupt */
void CAN_RX1_IRQHandler(void) {
	clearNvicIrqFor(CAN_RX1_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN SCE interrupt */
void CAN_SCE_IRQHandler(void) {
	clearNvicIrqFor(CAN_SCE_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN TX interrupt */
void CAN_TX_IRQHandler(void) {
	clearNvicIrqFor(CAN_TX_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN1 RX0 interrupts */
void CAN1_RX0_IRQHandler(void) {
	clearNvicIrqFor(CAN1_RX0_IRQn);
	STM32CubeDuinoIrqHandlerForCAN1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN1 RX1 interrupt */
void CAN1_RX1_IRQHandler(void) {
	clearNvicIrqFor(CAN1_RX1_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForCAN1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN1 SCE interrupt */
void CAN1_SCE_IRQHandler(void) {
	clearNvicIrqFor(CAN1_SCE_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForCAN1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN1 TX interrupts */
void CAN1_TX_IRQHandler(void) {
	clearNvicIrqFor(CAN1_TX_IRQn);
	STM32CubeDuinoIrqHandlerForCAN1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN2 RX0 interrupts */
void CAN2_RX0_IRQHandler(void) {
	clearNvicIrqFor(CAN2_RX0_IRQn);
	STM32CubeDuinoIrqHandlerForCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN2 RX1 interrupt */
void CAN2_RX1_IRQHandler(void) {
	clearNvicIrqFor(CAN2_RX1_IRQn);
	STM32CubeDuinoIrqHandlerForCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN2 SCE interrupt */
void CAN2_SCE_IRQHandler(void) {
	clearNvicIrqFor(CAN2_SCE_IRQn);
	STM32CubeDuinoIrqHandlerForCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN2 TX interrupts */
void CAN2_TX_IRQHandler(void) {
	clearNvicIrqFor(CAN2_TX_IRQn);
	STM32CubeDuinoIrqHandlerForCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN3 RX0 interrupts */
void CAN3_RX0_IRQHandler(void) {
	clearNvicIrqFor(CAN3_RX0_IRQn);
	STM32CubeDuinoIrqHandlerForCAN3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN3 RX1 interrupt */
void CAN3_RX1_IRQHandler(void) {
	clearNvicIrqFor(CAN3_RX1_IRQn);
	STM32CubeDuinoIrqHandlerForCAN3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN3 SCE interrupt */
void CAN3_SCE_IRQHandler(void) {
	clearNvicIrqFor(CAN3_SCE_IRQn);
	STM32CubeDuinoIrqHandlerForCAN3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CAN3 TX interrupts */
void CAN3_TX_IRQHandler(void) {
	clearNvicIrqFor(CAN3_TX_IRQn);
	STM32CubeDuinoIrqHandlerForCAN3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HDMI-CEC and CAN global interrupts / HDMI-CEC wake-up interrupt through EXTI line 27 */
void CEC_CAN_IRQHandler(void) {
	clearNvicIrqFor(CEC_CAN_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForHDMI_CEC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HDMI-CEC global interrupt / HDMI-CEC wake-up interrupt through EXTI line 27 */
void CEC_IRQHandler(void) {
	clearNvicIrqFor(CEC_IRQn);
	STM32CubeDuinoIrqHandlerForHDMI_CEC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Comparator channel acquisition global interrupt through EXTI line 23 */
void COMP_ACQ_IRQHandler(void) {
	clearNvicIrqFor(COMP_ACQ_IRQn);
	ifIsPendingIrqForCOMP1() STM32CubeDuinoIrqHandlerForCOMP1();
	ifIsPendingIrqForCOMP2() STM32CubeDuinoIrqHandlerForCOMP2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP1 and COMP2 wake-up interrupts through EXTI lines 21 and 22 */
void COMP_IRQHandler(void) {
	clearNvicIrqFor(COMP_IRQn);
	ifIsPendingIrqForCOMP1() STM32CubeDuinoIrqHandlerForCOMP1();
	ifIsPendingIrqForCOMP2() STM32CubeDuinoIrqHandlerForCOMP2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP1 and COMP2 interrupts through EXTI lines 21 and 22 */
void COMP1_2_IRQHandler(void) {
	clearNvicIrqFor(COMP1_2_IRQn);
	ifIsPendingIrqForCOMP1() STM32CubeDuinoIrqHandlerForCOMP1();
	ifIsPendingIrqForCOMP2() STM32CubeDuinoIrqHandlerForCOMP2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP1, COMP2 and COMP3 interrupts through EXTI lines 21, 22 and 29 */
void COMP1_2_3_IRQHandler(void) {
	clearNvicIrqFor(COMP1_2_3_IRQn);
	ifIsPendingIrqForCOMP1() STM32CubeDuinoIrqHandlerForCOMP1();
	ifIsPendingIrqForCOMP2() STM32CubeDuinoIrqHandlerForCOMP2();
	STM32CubeDuinoIrqHandlerForCOMP3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP2 global interrupt through EXTI line 22 */
void COMP2_IRQHandler(void) {
	clearNvicIrqFor(COMP2_IRQn);
	ifIsPendingIrqForCOMP2() STM32CubeDuinoIrqHandlerForCOMP2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP4 interrupt through EXTI line 30 */
void COMP4_IRQHandler(void) {
	clearNvicIrqFor(COMP4_IRQn);
	STM32CubeDuinoIrqHandlerForCOMP4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP4, COMP5 and COMP6 interrupts through EXTI lines 30, 31 and 32 */
void COMP4_5_6_IRQHandler(void) {
	clearNvicIrqFor(COMP4_5_6_IRQn);
	STM32CubeDuinoIrqHandlerForCOMP4();
	STM32CubeDuinoIrqHandlerForCOMP5();
	STM32CubeDuinoIrqHandlerForCOMP6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP4 and COMP6 interrupts through EXTI lines 30 and 32 */
void COMP4_6_IRQHandler(void) {
	clearNvicIrqFor(COMP4_6_IRQn);
	STM32CubeDuinoIrqHandlerForCOMP4();
	STM32CubeDuinoIrqHandlerForCOMP6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** COMP7 interrupt through EXTI line 33 */
void COMP7_IRQHandler(void) {
	clearNvicIrqFor(COMP7_IRQn);
	STM32CubeDuinoIrqHandlerForCOMP7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CORDIC interrupt */
void CORDIC_IRQHandler(void) {
	clearNvicIrqFor(CORDIC_IRQn);
	STM32CubeDuinoIrqHandlerForCORDIC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Clock Recovery System global interrupt */
void CRS_IRQHandler(void) {
	clearNvicIrqFor(CRS_IRQn);
	STM32CubeDuinoIrqHandlerForRCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CRYP global interrupt */
void CRYP_IRQHandler(void) {
	clearNvicIrqFor(CRYP_IRQn);
	STM32CubeDuinoIrqHandlerForCRYP();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CRYP1 global interrupt */
void CRYP1_IRQHandler(void) {
	clearNvicIrqFor(CRYP1_IRQn);
	STM32CubeDuinoIrqHandlerForCRYP1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** CRYP2 global interrupt */
void CRYP2_IRQHandler(void) {
	clearNvicIrqFor(CRYP2_IRQn);
	STM32CubeDuinoIrqHandlerForCRYP2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE))
/** DAC_CH1 and DAC_CH2 underrun error interrupt */
void DAC_IRQHandler(void) {
	clearNvicIrqFor(DAC_IRQn);
	ifIsPendingIrqForDAC() STM32CubeDuinoIrqHandlerForDAC();
	STM32CubeDuinoIrqHandlerForDAC1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE))
/** DAC2 global interrupt */
void DAC2_IRQHandler(void) {
	clearNvicIrqFor(DAC2_IRQn);
	STM32CubeDuinoIrqHandlerForDAC2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DCMI global interrupt */
void DCMI_IRQHandler(void) {
	clearNvicIrqFor(DCMI_IRQn);
	STM32CubeDuinoIrqHandlerForDCMI();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DCMI and PSSI global interrupt */
void DCMI_PSSI_IRQHandler(void) {
	clearNvicIrqFor(DCMI_PSSI_IRQn);
	STM32CubeDuinoIrqHandlerForDCMI();
	STM32CubeDuinoIrqHandlerForPSSI();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter0 global interrupt */
void DFSDM1_FLT0_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT0_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter1 global interrupt */
void DFSDM1_FLT1_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT1_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter2 global interrupt */
void DFSDM1_FLT2_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT2_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter3 global interrupt */
void DFSDM1_FLT3_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT3_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter4 global interrupt */
void DFSDM1_FLT4_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT4_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter5 global interrupt */
void DFSDM1_FLT5_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT5_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter6 global interrupt */
void DFSDM1_FLT6_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT6_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM1 filter7 global interrupt */
void DFSDM1_FLT7_IRQHandler(void) {
	clearNvicIrqFor(DFSDM1_FLT7_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM2 filter0 global interrupt */
void DFSDM2_FLT0_IRQHandler(void) {
	clearNvicIrqFor(DFSDM2_FLT0_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM2 filter1 global interrupt */
void DFSDM2_FLT1_IRQHandler(void) {
	clearNvicIrqFor(DFSDM2_FLT1_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM2 filter2 global interrupt */
void DFSDM2_FLT2_IRQHandler(void) {
	clearNvicIrqFor(DFSDM2_FLT2_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM2 filter3 global interrupt */
void DFSDM2_FLT3_IRQHandler(void) {
	clearNvicIrqFor(DFSDM2_FLT3_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DFSDM2 global interrupt */
void DFSDM2_IRQHandler(void) {
	clearNvicIrqFor(DFSDM2_IRQn);
	STM32CubeDuinoIrqHandlerForDFSDM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMAMUX overrun interrupt */
void DMAMUX_OVR_IRQHandler(void) {
	clearNvicIrqFor(DMAMUX_OVR_IRQn);
	STM32CubeDuinoIrqHandlerForDMA();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMAMUX1 non-secure overrun interrupt */
void DMAMUX1_IRQHandler(void) {
	clearNvicIrqFor(DMAMUX1_IRQn);
	STM32CubeDuinoIrqHandlerForDMA();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMAMUX1 overrun interrupt */
void DMAMUX1_OVR_IRQHandler(void) {
	clearNvicIrqFor(DMAMUX1_OVR_IRQn);
	STM32CubeDuinoIrqHandlerForDMA();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMAMUX1 secure overrun interrupt */
void DMAMUX1_S_IRQHandler(void) {
	clearNvicIrqFor(DMAMUX1_S_IRQn);
	STM32CubeDuinoIrqHandlerForDMA();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMAMUX2 overrun interrupt */
void DMAMUX2_OVR_IRQHandler(void) {
	clearNvicIrqFor(DMAMUX2_OVR_IRQn);
	STM32CubeDuinoIrqHandlerForBDMA();
	STM32CubeDuinoIrqHandlerForBDMA2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 1 global interrupt */
void DMA1_Channel1_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel1_IRQn);
	ifIsPendingIrqForDMA1_CH1() STM32CubeDuinoIrqHandlerForDMA1_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel2 global interrupt */
void DMA1_Channel2_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel2_IRQn);
	ifIsPendingIrqForDMA1_CH2() STM32CubeDuinoIrqHandlerForDMA1_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 2 and channel 3 interrupts */
void DMA1_Channel2_3_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel2_3_IRQn);
	ifIsPendingIrqForDMA1_CH2() STM32CubeDuinoIrqHandlerForDMA1_CH2();
	ifIsPendingIrqForDMA1_CH3() STM32CubeDuinoIrqHandlerForDMA1_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel3 global interrupt */
void DMA1_Channel3_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel3_IRQn);
	ifIsPendingIrqForDMA1_CH3() STM32CubeDuinoIrqHandlerForDMA1_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel4 global interrupt */
void DMA1_Channel4_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel4_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 4 and channel 5 interrupts */
void DMA1_Channel4_5_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel4_5_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 4, channel 5, channel 6 and channel 7 interrupts */
void DMA1_Channel4_5_6_7_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel4_5_6_7_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
	ifIsPendingIrqForDMA1_CH6() STM32CubeDuinoIrqHandlerForDMA1_CH6();
	ifIsPendingIrqForDMA1_CH7() STM32CubeDuinoIrqHandlerForDMA1_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel5 global interrupt */
void DMA1_Channel5_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel5_IRQn);
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel6 global interrupt */
void DMA1_Channel6_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel6_IRQn);
	ifIsPendingIrqForDMA1_CH6() STM32CubeDuinoIrqHandlerForDMA1_CH6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel7 global interrupt */
void DMA1_Channel7_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel7_IRQn);
	ifIsPendingIrqForDMA1_CH7() STM32CubeDuinoIrqHandlerForDMA1_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel8 global interrupt */
void DMA1_Channel8_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Channel8_IRQn);
	STM32CubeDuinoIrqHandlerForDMA1_CH8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 1 interrupt */
void DMA1_Ch1_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Ch1_IRQn);
	ifIsPendingIrqForDMA1_CH1() STM32CubeDuinoIrqHandlerForDMA1_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 2 to 3 and DMA2 channel 1 to 2 interrupts */
void DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Ch2_3_DMA2_Ch1_2_IRQn);
	ifIsPendingIrqForDMA1_CH2() STM32CubeDuinoIrqHandlerForDMA1_CH2();
	ifIsPendingIrqForDMA1_CH3() STM32CubeDuinoIrqHandlerForDMA1_CH3();
	ifIsPendingIrqForDMA2_CH1() STM32CubeDuinoIrqHandlerForDMA2_CH1();
	ifIsPendingIrqForDMA2_CH2() STM32CubeDuinoIrqHandlerForDMA2_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 4, channel 5 and DMAMUX1 interrupts */
void DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Ch4_5_DMAMUX1_OVR_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 4, channel 5, channel 6, channel 7 and DMAMUX1 interrupts */
void DMA1_Ch4_7_DMAMUX1_OVR_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Ch4_7_DMAMUX1_OVR_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
	ifIsPendingIrqForDMA1_CH6() STM32CubeDuinoIrqHandlerForDMA1_CH6();
	ifIsPendingIrqForDMA1_CH7() STM32CubeDuinoIrqHandlerForDMA1_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


