daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 channel 4 to 7 and DMA2 channel 3 to 5 interrupts */
void DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Ch4_7_DMA2_Ch3_5_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
	ifIsPendingIrqForDMA1_CH6() STM32CubeDuinoIrqHandlerForDMA1_CH6();
	ifIsPendingIrqForDMA1_CH7() STM32CubeDuinoIrqHandlerForDMA1_CH7();
	ifIsPendingIrqForDMA2_CH3() STM32CubeDuinoIrqHandlerForDMA2_CH3();
	ifIsPendingIrqForDMA2_CH4() STM32CubeDuinoIrqHandlerForDMA2_CH4();
	ifIsPendingIrqForDMA2_CH5() STM32CubeDuinoIrqHandlerForDMA2_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream0 global interrupt */
void DMA1_Stream0_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream0_IRQn);
	STM32CubeDuinoIrqHandlerForDMA1_CH0();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream1 global interrupt */
void DMA1_Stream1_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream1_IRQn);
	ifIsPendingIrqForDMA1_CH1() STM32CubeDuinoIrqHandlerForDMA1_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream2 global interrupt */
void DMA1_Stream2_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream2_IRQn);
	ifIsPendingIrqForDMA1_CH2() STM32CubeDuinoIrqHandlerForDMA1_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream3 global interrupt */
void DMA1_Stream3_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream3_IRQn);
	ifIsPendingIrqForDMA1_CH3() STM32CubeDuinoIrqHandlerForDMA1_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream4 global interrupt */
void DMA1_Stream4_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream4_IRQn);
	ifIsPendingIrqForDMA1_CH4() STM32CubeDuinoIrqHandlerForDMA1_CH4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream5 global interrupt */
void DMA1_Stream5_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream5_IRQn);
	ifIsPendingIrqForDMA1_CH5() STM32CubeDuinoIrqHandlerForDMA1_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream6 global interrupt */
void DMA1_Stream6_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream6_IRQn);
	ifIsPendingIrqForDMA1_CH6() STM32CubeDuinoIrqHandlerForDMA1_CH6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA1 stream7 global interrupt */
void DMA1_Stream7_IRQHandler(void) {
	clearNvicIrqFor(DMA1_Stream7_IRQn);
	ifIsPendingIrqForDMA1_CH7() STM32CubeDuinoIrqHandlerForDMA1_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2D global interrupt */
void DMA2D_IRQHandler(void) {
	clearNvicIrqFor(DMA2D_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2D();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel1 global interrupt */
void DMA2_Channel1_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel1_IRQn);
	ifIsPendingIrqForDMA2_CH1() STM32CubeDuinoIrqHandlerForDMA2_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel2 global interrupt */
void DMA2_Channel2_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel2_IRQn);
	ifIsPendingIrqForDMA2_CH2() STM32CubeDuinoIrqHandlerForDMA2_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel3 global interrupt */
void DMA2_Channel3_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel3_IRQn);
	ifIsPendingIrqForDMA2_CH3() STM32CubeDuinoIrqHandlerForDMA2_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel4 global interrupt */
void DMA2_Channel4_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel4_IRQn);
	ifIsPendingIrqForDMA2_CH4() STM32CubeDuinoIrqHandlerForDMA2_CH4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel4 and channel5 global interrupts */
void DMA2_Channel4_5_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel4_5_IRQn);
	ifIsPendingIrqForDMA2_CH4() STM32CubeDuinoIrqHandlerForDMA2_CH4();
	ifIsPendingIrqForDMA2_CH5() STM32CubeDuinoIrqHandlerForDMA2_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel5 global interrupt */
void DMA2_Channel5_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel5_IRQn);
	ifIsPendingIrqForDMA2_CH5() STM32CubeDuinoIrqHandlerForDMA2_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel6 global interrupt */
void DMA2_Channel6_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel6_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2_CH6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel7 global interrupt */
void DMA2_Channel7_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel7_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 channel8 global interrupt */
void DMA2_Channel8_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Channel8_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2_CH8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream0 global interrupt */
void DMA2_Stream0_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream0_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2_CH0();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream1 global interrupt */
void DMA2_Stream1_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream1_IRQn);
	ifIsPendingIrqForDMA2_CH1() STM32CubeDuinoIrqHandlerForDMA2_CH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream2 global interrupt */
void DMA2_Stream2_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream2_IRQn);
	ifIsPendingIrqForDMA2_CH2() STM32CubeDuinoIrqHandlerForDMA2_CH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream3 global interrupt */
void DMA2_Stream3_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream3_IRQn);
	ifIsPendingIrqForDMA2_CH3() STM32CubeDuinoIrqHandlerForDMA2_CH3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream4 global interrupt */
void DMA2_Stream4_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream4_IRQn);
	ifIsPendingIrqForDMA2_CH4() STM32CubeDuinoIrqHandlerForDMA2_CH4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream5 global interrupt */
void DMA2_Stream5_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream5_IRQn);
	ifIsPendingIrqForDMA2_CH5() STM32CubeDuinoIrqHandlerForDMA2_CH5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream6 global interrupt */
void DMA2_Stream6_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream6_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2_CH6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DMA2 stream7 global interrupt */
void DMA2_Stream7_IRQHandler(void) {
	clearNvicIrqFor(DMA2_Stream7_IRQn);
	STM32CubeDuinoIrqHandlerForDMA2_CH7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** DSI global interrupt */
void DSI_IRQHandler(void) {
	clearNvicIrqFor(DSI_IRQn);
	STM32CubeDuinoIrqHandlerForDSIHOST();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Digital Temperature Sensor Global Interrupt */
void DTS_IRQHandler(void) {
	clearNvicIrqFor(DTS_IRQn);
	STM32CubeDuinoIrqHandlerForDTS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Ethernet global interrupt */
void ETH_IRQHandler(void) {
	clearNvicIrqFor(ETH_IRQn);
	STM32CubeDuinoIrqHandlerForETH();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Ethernet wake-up interrupt through EXTI line 19 */
void ETH_WKUP_IRQHandler(void) {
	clearNvicIrqFor(ETH_WKUP_IRQn);
	STM32CubeDuinoIrqHandlerForETH();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Ethernet global interrupt */
void ETH1_IRQHandler(void) {
	clearNvicIrqFor(ETH1_IRQn);
	STM32CubeDuinoIrqHandlerForETH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Ethernet low power idle interrupt */
void ETH1_LPI_IRQHandler(void) {
	clearNvicIrqFor(ETH1_LPI_IRQn);
	STM32CubeDuinoIrqHandlerForETH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Ethernet wake-up interrupt */
void ETH1_WKUP_IRQHandler(void) {
	clearNvicIrqFor(ETH1_WKUP_IRQn);
	STM32CubeDuinoIrqHandlerForETH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || !defined(STM32CUBEDUINO_DISABLE_EXTI)
/** EXTI line 0 interrupt */
void EXTI0_IRQHandler(void) {
	clearNvicIrqFor(EXTI0_IRQn);
	ifIsPendingIrqForEXTI0() STM32CubeDuinoIrqHandlerForEXTI0();
}


/** EXTI line 0 and line 1 interrupts */
void EXTI0_1_IRQHandler(void) {
	clearNvicIrqFor(EXTI0_1_IRQn);
	ifIsPendingIrqForEXTI0() STM32CubeDuinoIrqHandlerForEXTI0();
	ifIsPendingIrqForEXTI1() STM32CubeDuinoIrqHandlerForEXTI1();
}


/** EXTI line 1 interrupt */
void EXTI1_IRQHandler(void) {
	clearNvicIrqFor(EXTI1_IRQn);
	ifIsPendingIrqForEXTI1() STM32CubeDuinoIrqHandlerForEXTI1();
}


/** EXTI line 2 interrupt */
void EXTI2_IRQHandler(void) {
	clearNvicIrqFor(EXTI2_IRQn);
	ifIsPendingIrqForEXTI2() STM32CubeDuinoIrqHandlerForEXTI2();
}


/** EXTI line2 interrupt and touch sense controller interrupt */
void EXTI2_TSC_IRQHandler(void) {
	clearNvicIrqFor(EXTI2_TSC_IRQn);
	ifIsPendingIrqForEXTI2() STM32CubeDuinoIrqHandlerForEXTI2();
	ifIsPendingIrqForTSC() STM32CubeDuinoIrqHandlerForTSC();
}


/** EXTI line 2 and line 3 interrupts */
void EXTI2_3_IRQHandler(void) {
	clearNvicIrqFor(EXTI2_3_IRQn);
	ifIsPendingIrqForEXTI2() STM32CubeDuinoIrqHandlerForEXTI2();
	ifIsPendingIrqForEXTI3() STM32CubeDuinoIrqHandlerForEXTI3();
}


