daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
/** EXTI line 3 interrupt */
void EXTI3_IRQHandler(void) {
	clearNvicIrqFor(EXTI3_IRQn);
	ifIsPendingIrqForEXTI3() STM32CubeDuinoIrqHandlerForEXTI3();
}


/** EXTI line 4 interrupt */
void EXTI4_IRQHandler(void) {
	clearNvicIrqFor(EXTI4_IRQn);
	ifIsPendingIrqForEXTI4() STM32CubeDuinoIrqHandlerForEXTI4();
}


/** EXTI line 4 to 15 interrupts */
void EXTI4_15_IRQHandler(void) {
	clearNvicIrqFor(EXTI4_15_IRQn);
	ifIsPendingIrqForEXTI4() STM32CubeDuinoIrqHandlerForEXTI4();
	ifIsPendingIrqForEXTI5() STM32CubeDuinoIrqHandlerForEXTI5();
	ifIsPendingIrqForEXTI6() STM32CubeDuinoIrqHandlerForEXTI6();
	ifIsPendingIrqForEXTI7() STM32CubeDuinoIrqHandlerForEXTI7();
	ifIsPendingIrqForEXTI8() STM32CubeDuinoIrqHandlerForEXTI8();
	ifIsPendingIrqForEXTI9() STM32CubeDuinoIrqHandlerForEXTI9();
	ifIsPendingIrqForEXTI10() STM32CubeDuinoIrqHandlerForEXTI10();
	ifIsPendingIrqForEXTI11() STM32CubeDuinoIrqHandlerForEXTI11();
	ifIsPendingIrqForEXTI12() STM32CubeDuinoIrqHandlerForEXTI12();
	ifIsPendingIrqForEXTI13() STM32CubeDuinoIrqHandlerForEXTI13();
	ifIsPendingIrqForEXTI14() STM32CubeDuinoIrqHandlerForEXTI14();
	ifIsPendingIrqForEXTI15() STM32CubeDuinoIrqHandlerForEXTI15();
}


/** EXTI line5 interrupt */
void EXTI5_IRQHandler(void) {
	clearNvicIrqFor(EXTI5_IRQn);
	ifIsPendingIrqForEXTI5() STM32CubeDuinoIrqHandlerForEXTI5();
}


/** EXTI line6 interrupt */
void EXTI6_IRQHandler(void) {
	clearNvicIrqFor(EXTI6_IRQn);
	ifIsPendingIrqForEXTI6() STM32CubeDuinoIrqHandlerForEXTI6();
}


/** EXTI line7 interrupt */
void EXTI7_IRQHandler(void) {
	clearNvicIrqFor(EXTI7_IRQn);
	ifIsPendingIrqForEXTI7() STM32CubeDuinoIrqHandlerForEXTI7();
}


/** EXTI line8 interrupt */
void EXTI8_IRQHandler(void) {
	clearNvicIrqFor(EXTI8_IRQn);
	ifIsPendingIrqForEXTI8() STM32CubeDuinoIrqHandlerForEXTI8();
}


/** EXTI line9 interrupt */
void EXTI9_IRQHandler(void) {
	clearNvicIrqFor(EXTI9_IRQn);
	ifIsPendingIrqForEXTI9() STM32CubeDuinoIrqHandlerForEXTI9();
}


/** EXTI line[9:5] interrupts */
void EXTI9_5_IRQHandler(void) {
	clearNvicIrqFor(EXTI9_5_IRQn);
	ifIsPendingIrqForEXTI5() STM32CubeDuinoIrqHandlerForEXTI5();
	ifIsPendingIrqForEXTI6() STM32CubeDuinoIrqHandlerForEXTI6();
	ifIsPendingIrqForEXTI7() STM32CubeDuinoIrqHandlerForEXTI7();
	ifIsPendingIrqForEXTI8() STM32CubeDuinoIrqHandlerForEXTI8();
	ifIsPendingIrqForEXTI9() STM32CubeDuinoIrqHandlerForEXTI9();
}


/** EXTI line10 interrupt */
void EXTI10_IRQHandler(void) {
	clearNvicIrqFor(EXTI10_IRQn);
	ifIsPendingIrqForEXTI10() STM32CubeDuinoIrqHandlerForEXTI10();
}


/** EXTI line11 interrupt */
void EXTI11_IRQHandler(void) {
	clearNvicIrqFor(EXTI11_IRQn);
	ifIsPendingIrqForEXTI11() STM32CubeDuinoIrqHandlerForEXTI11();
}


/** EXTI line12 interrupt */
void EXTI12_IRQHandler(void) {
	clearNvicIrqFor(EXTI12_IRQn);
	ifIsPendingIrqForEXTI12() STM32CubeDuinoIrqHandlerForEXTI12();
}


/** EXTI line13 interrupt */
void EXTI13_IRQHandler(void) {
	clearNvicIrqFor(EXTI13_IRQn);
	ifIsPendingIrqForEXTI13() STM32CubeDuinoIrqHandlerForEXTI13();
}


/** EXTI line14 interrupt */
void EXTI14_IRQHandler(void) {
	clearNvicIrqFor(EXTI14_IRQn);
	ifIsPendingIrqForEXTI14() STM32CubeDuinoIrqHandlerForEXTI14();
}


/** EXTI line15 interrupt */
void EXTI15_IRQHandler(void) {
	clearNvicIrqFor(EXTI15_IRQn);
	ifIsPendingIrqForEXTI15() STM32CubeDuinoIrqHandlerForEXTI15();
}


/** EXTI line[15:10] interrupts */
void EXTI15_10_IRQHandler(void) {
	clearNvicIrqFor(EXTI15_10_IRQn);
	ifIsPendingIrqForEXTI10() STM32CubeDuinoIrqHandlerForEXTI10();
	ifIsPendingIrqForEXTI11() STM32CubeDuinoIrqHandlerForEXTI11();
	ifIsPendingIrqForEXTI12() STM32CubeDuinoIrqHandlerForEXTI12();
	ifIsPendingIrqForEXTI13() STM32CubeDuinoIrqHandlerForEXTI13();
	ifIsPendingIrqForEXTI14() STM32CubeDuinoIrqHandlerForEXTI14();
	ifIsPendingIrqForEXTI15() STM32CubeDuinoIrqHandlerForEXTI15();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN calibration unit interrupt */
void FDCAN_CAL_IRQHandler(void) {
	clearNvicIrqFor(FDCAN_CAL_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN1();
	STM32CubeDuinoIrqHandlerForFDCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN1 interrupt 0 */
void FDCAN1_IT0_IRQHandler(void) {
	clearNvicIrqFor(FDCAN1_IT0_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN1 interrupt 1 */
void FDCAN1_IT1_IRQHandler(void) {
	clearNvicIrqFor(FDCAN1_IT1_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN2 interrupt 0 */
void FDCAN2_IT0_IRQHandler(void) {
	clearNvicIrqFor(FDCAN2_IT0_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN2 interrupt 1 */
void FDCAN2_IT1_IRQHandler(void) {
	clearNvicIrqFor(FDCAN2_IT1_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN3 interrupt 0 */
void FDCAN3_IT0_IRQHandler(void) {
	clearNvicIrqFor(FDCAN3_IT0_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FDCAN3 interrupt 1 */
void FDCAN3_IT1_IRQHandler(void) {
	clearNvicIrqFor(FDCAN3_IT1_IRQn);
	STM32CubeDuinoIrqHandlerForFDCAN3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Flash and EEPROM global interrupt */
void FLASH_IRQHandler(void) {
	clearNvicIrqFor(FLASH_IRQn);
	ifIsPendingIrqForFLASH() STM32CubeDuinoIrqHandlerForFLASH();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Flash secure global interrupt */
void FLASH_S_IRQHandler(void) {
	clearNvicIrqFor(FLASH_S_IRQn);
	ifIsPendingIrqForFLASH() STM32CubeDuinoIrqHandlerForFLASH();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FMAC interrupt */
void FMAC_IRQHandler(void) {
	clearNvicIrqFor(FMAC_IRQn);
	STM32CubeDuinoIrqHandlerForFMAC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FMC global interrupt */
void FMC_IRQHandler(void) {
	clearNvicIrqFor(FMC_IRQn);
	STM32CubeDuinoIrqHandlerForFMC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FMPI2C1 error interrupt */
void FMPI2C1_ER_IRQHandler(void) {
	clearNvicIrqFor(FMPI2C1_ER_IRQn);
	STM32CubeDuinoIrqHandlerForFMPI2C1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FMPI2C1 event interrupt */
void FMPI2C1_EV_IRQHandler(void) {
	clearNvicIrqFor(FMPI2C1_EV_IRQn);
	STM32CubeDuinoIrqHandlerForFMPI2C1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** FSMC global interrupt */
void FSMC_IRQHandler(void) {
	clearNvicIrqFor(FSMC_IRQn);
	STM32CubeDuinoIrqHandlerForFSMC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** GFXMMU global error interrupt */
void GFXMMU_IRQHandler(void) {
	clearNvicIrqFor(GFXMMU_IRQn);
	STM32CubeDuinoIrqHandlerForGFXMMU();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** GPU global interrupt */
void GPU_IRQHandler(void) {
	clearNvicIrqFor(GPU_IRQn);
	STM32CubeDuinoIrqHandlerForGPU();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Global TrustZone controller global interrupt */
void GTZC_IRQHandler(void) {
	clearNvicIrqFor(GTZC_IRQn);
	STM32CubeDuinoIrqHandlerForGTZC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HASH and CRS global interrupts */
void HASH_CRS_IRQHandler(void) {
	clearNvicIrqFor(HASH_CRS_IRQn);
	STM32CubeDuinoIrqHandlerForHASH();
	STM32CubeDuinoIrqHandlerForRCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HASH global interrupt */
void HASH_IRQHandler(void) {
	clearNvicIrqFor(HASH_IRQn);
	STM32CubeDuinoIrqHandlerForHASH();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HASH and RNG global interrupts */
void HASH_RNG_IRQHandler(void) {
	clearNvicIrqFor(HASH_RNG_IRQn);
	STM32CubeDuinoIrqHandlerForHASH();
	STM32CubeDuinoIrqHandlerForRNG();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HASH1 global interrupt */
void HASH1_IRQHandler(void) {
	clearNvicIrqFor(HASH1_IRQn);
	STM32CubeDuinoIrqHandlerForHASH1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HASH2 global interrupt */
void HASH2_IRQHandler(void) {
	clearNvicIrqFor(HASH2_IRQn);
	STM32CubeDuinoIrqHandlerForHASH2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM fault global interrupt */
void HRTIM1_FLT_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_FLT_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM master timer global interrupt */
void HRTIM1_Master_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_Master_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM timer A global interrupt */
void HRTIM1_TIMA_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_TIMA_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM timer B global interrupt */
void HRTIM1_TIMB_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_TIMB_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM timer C global interrupt */
void HRTIM1_TIMC_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_TIMC_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM timer D global interrupt */
void HRTIM1_TIMD_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_TIMD_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM timer E global interrupt */
void HRTIM1_TIME_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_TIME_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM();
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HRTIM timer F global interrupt */
void HRTIM1_TIMF_IRQHandler(void) {
	clearNvicIrqFor(HRTIM1_TIMF_IRQn);
	STM32CubeDuinoIrqHandlerForHRTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** HSEM global interrupt */
void HSEM_IRQHandler(void) {
	clearNvicIrqFor(HSEM_IRQn);
	STM32CubeDuinoIrqHandlerForHSEM();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Instruction cache global interrupt */
void ICACHE_IRQHandler(void) {
	clearNvicIrqFor(ICACHE_IRQn);
	STM32CubeDuinoIrqHandlerForICACHE();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** IPCC RX occupied interrupt */
void IPCC_C1_RX_IRQHandler(void) {
	clearNvicIrqFor(IPCC_C1_RX_IRQn);
	STM32CubeDuinoIrqHandlerForIPCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** IPCC TX free interrupt */
void IPCC_C1_TX_IRQHandler(void) {
	clearNvicIrqFor(IPCC_C1_TX_IRQn);
	STM32CubeDuinoIrqHandlerForIPCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** IPCC RX0 occupied interrupt */
void IPCC_RX0_IRQHandler(void) {
	clearNvicIrqFor(IPCC_RX0_IRQn);
	STM32CubeDuinoIrqHandlerForIPCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** IPCC RX1 occupied interrupt */
void IPCC_RX1_IRQHandler(void) {
	clearNvicIrqFor(IPCC_RX1_IRQn);
	STM32CubeDuinoIrqHandlerForIPCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** IPCC TX0 free interrupt */
void IPCC_TX0_IRQHandler(void) {
	clearNvicIrqFor(IPCC_TX0_IRQn);
	STM32CubeDuinoIrqHandlerForIPCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** IPCC TX1 free interrupt */
void IPCC_TX1_IRQHandler(void) {
	clearNvicIrqFor(IPCC_TX1_IRQn);
	STM32CubeDuinoIrqHandlerForIPCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C1 error interrupt */
void I2C1_ER_IRQHandler(void) {
	clearNvicIrqFor(I2C1_ER_IRQn);
	ifIsPendingIrqForI2C1() STM32CubeDuinoIrqHandlerForI2C1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C1 event global interrupt / I2C1 wake-up interrupt through EXTI line 23 */
void I2C1_EV_IRQHandler(void) {
	clearNvicIrqFor(I2C1_EV_IRQn);
	ifIsPendingIrqForI2C1() STM32CubeDuinoIrqHandlerForI2C1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C1 event global interrupt / I2C1 wake-up interrupt through EXTI line 23 */
void I2C1_IRQHandler(void) {
	clearNvicIrqFor(I2C1_IRQn);
	ifIsPendingIrqForI2C1() STM32CubeDuinoIrqHandlerForI2C1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C2 error interrupt */
void I2C2_ER_IRQHandler(void) {
	clearNvicIrqFor(I2C2_ER_IRQn);
	ifIsPendingIrqForI2C2() STM32CubeDuinoIrqHandlerForI2C2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C2 event global interrupt / I2C2 wake-up interrupt through EXTI line 24 */
void I2C2_EV_IRQHandler(void) {
	clearNvicIrqFor(I2C2_EV_IRQn);
	ifIsPendingIrqForI2C2() STM32CubeDuinoIrqHandlerForI2C2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C2 global interrupt */
void I2C2_IRQHandler(void) {
	clearNvicIrqFor(I2C2_IRQn);
	ifIsPendingIrqForI2C2() STM32CubeDuinoIrqHandlerForI2C2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C3 error interrupt */
void I2C3_ER_IRQHandler(void) {
	clearNvicIrqFor(I2C3_ER_IRQn);
	STM32CubeDuinoIrqHandlerForI2C3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C3 event interrupt / I2C3 wake-up interrupt through EXTI line 25 */
void I2C3_EV_IRQHandler(void) {
	clearNvicIrqFor(I2C3_EV_IRQn);
	STM32CubeDuinoIrqHandlerForI2C3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C3 global interrupt / I2C3 wake-up interrupt through EXTI line 24 */
void I2C3_IRQHandler(void) {
	clearNvicIrqFor(I2C3_IRQn);
	STM32CubeDuinoIrqHandlerForI2C3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C4 error interrupt */
void I2C4_ER_IRQHandler(void) {
	clearNvicIrqFor(I2C4_ER_IRQn);
	STM32CubeDuinoIrqHandlerForI2C4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C4 event interrupt / I2C4 wake-up interrupt through EXTI line 40 */
void I2C4_EV_IRQHandler(void) {
	clearNvicIrqFor(I2C4_EV_IRQn);
	STM32CubeDuinoIrqHandlerForI2C4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C5 error interrupt */
void I2C5_ER_IRQHandler(void) {
	clearNvicIrqFor(I2C5_ER_IRQn);
	STM32CubeDuinoIrqHandlerForI2C5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C5 event interrupt */
void I2C5_EV_IRQHandler(void) {
	clearNvicIrqFor(I2C5_EV_IRQn);
	STM32CubeDuinoIrqHandlerForI2C5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C6 error interrupt */
void I2C6_ER_IRQHandler(void) {
	clearNvicIrqFor(I2C6_ER_IRQn);
	STM32CubeDuinoIrqHandlerForI2C6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_I2C) && defined(IS_I2C_ADDRESSING_MODE))
/** I2C6 event interrupt */
void I2C6_EV_IRQHandler(void) {
	clearNvicIrqFor(I2C6_EV_IRQn);
	STM32CubeDuinoIrqHandlerForI2C6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_I2C_ADDRESSING_MODE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** JPEG global interrupt */
void JPEG_IRQHandler(void) {
	clearNvicIrqFor(JPEG_IRQn);
	STM32CubeDuinoIrqHandlerForJPEG();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** LCD global interrupt */
void LCD_IRQHandler(void) {
	clearNvicIrqFor(LCD_IRQn);
	STM32CubeDuinoIrqHandlerForLCD();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(LPTIM_PRESCALER_DIV1))
/** LPTIM1 global interrupt / LPTIM1 wake-up interrupt through EXTI line 29 */
void LPTIM1_IRQHandler(void) {
	clearNvicIrqFor(LPTIM1_IRQn);
	STM32CubeDuinoIrqHandlerForLPTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or LPTIM_PRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(LPTIM_PRESCALER_DIV1))
/** LPTIM2 global interrupt through EXTI line 33 */
void LPTIM2_IRQHandler(void) {
	clearNvicIrqFor(LPTIM2_IRQn);
	STM32CubeDuinoIrqHandlerForLPTIM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or LPTIM_PRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(LPTIM_PRESCALER_DIV1))
/** LPTIM3 global interrupt / LPTIM3 wake-up interrupt through EXTI line 42 */
void LPTIM3_IRQHandler(void) {
	clearNvicIrqFor(LPTIM3_IRQn);
	STM32CubeDuinoIrqHandlerForLPTIM3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or LPTIM_PRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(LPTIM_PRESCALER_DIV1))
/** LPTIM4 global interrupt */
void LPTIM4_IRQHandler(void) {
	clearNvicIrqFor(LPTIM4_IRQn);
	STM32CubeDuinoIrqHandlerForLPTIM4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or LPTIM_PRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(LPTIM_PRESCALER_DIV1))
/** LPTIM5 global interrupt */
void LPTIM5_IRQHandler(void) {
	clearNvicIrqFor(LPTIM5_IRQn);
	STM32CubeDuinoIrqHandlerForLPTIM5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or LPTIM_PRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** LPUART1 global interrupt / LPUART1 wake-up interrupt through EXTI line 28 */
void LPUART1_IRQHandler(void) {
	clearNvicIrqFor(LPUART1_IRQn);
	STM32CubeDuinoIrqHandlerForLPUART1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** LTDC Error global Interrupt */
void LTDC_ER_IRQHandler(void) {
	clearNvicIrqFor(LTDC_ER_IRQn);
	STM32CubeDuinoIrqHandlerForLTDC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** LTDC global interrupt */
void LTDC_IRQHandler(void) {
	clearNvicIrqFor(LTDC_IRQn);
	STM32CubeDuinoIrqHandlerForLTDC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** MDIO slave global interrupt */
void MDIOS_IRQHandler(void) {
	clearNvicIrqFor(MDIOS_IRQn);
	STM32CubeDuinoIrqHandlerForMDIOS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** MDIOS wake-up interrupt */
void MDIOS_WKUP_IRQHandler(void) {
	clearNvicIrqFor(MDIOS_WKUP_IRQn);
	STM32CubeDuinoIrqHandlerForMDIOS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** MDMA global interrupt */
void MDMA_IRQHandler(void) {
	clearNvicIrqFor(MDMA_IRQn);
	STM32CubeDuinoIrqHandlerForMDMA();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** OCTOSPI1 global interrupt */
void OCTOSPI1_IRQHandler(void) {
	clearNvicIrqFor(OCTOSPI1_IRQn);
	STM32CubeDuinoIrqHandlerForOCTOSPI1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** OCTOSPI2 global interrupt */
void OCTOSPI2_IRQHandler(void) {
	clearNvicIrqFor(OCTOSPI2_IRQn);
	STM32CubeDuinoIrqHandlerForOCTOSPI2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** OTFDEC1 global interrupt */
void OTFDEC1_IRQHandler(void) {
	clearNvicIrqFor(OTFDEC1_IRQn);
	STM32CubeDuinoIrqHandlerForOTFDEC1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** OTFDEC2 global interrupt */
void OTFDEC2_IRQHandler(void) {
	clearNvicIrqFor(OTFDEC2_IRQn);
	STM32CubeDuinoIrqHandlerForOTFDEC2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB On The Go FS End Point 1 In global interrupt */
void OTG_FS_EP1_IN_IRQHandler(void) {
	clearNvicIrqFor(OTG_FS_EP1_IN_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_FS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB On The Go FS End Point 1 Out global interrupt */
void OTG_FS_EP1_OUT_IRQHandler(void) {
	clearNvicIrqFor(OTG_FS_EP1_OUT_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_FS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB On The Go FS global interrupt */
void OTG_FS_IRQHandler(void) {
	clearNvicIrqFor(OTG_FS_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_FS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB On The Go FS wake-up interrupt through EXTI line 18 */
void OTG_FS_WKUP_IRQHandler(void) {
	clearNvicIrqFor(OTG_FS_WKUP_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_FS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB On The Go HS End Point 1 In global interrupt */
void OTG_HS_EP1_IN_IRQHandler(void) {
	clearNvicIrqFor(OTG_HS_EP1_IN_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_HS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB On The Go HS End Point 1 Out global interrupt */
void OTG_HS_EP1_OUT_IRQHandler(void) {
	clearNvicIrqFor(OTG_HS_EP1_OUT_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_HS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


