daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB On The Go HS global interrupt */
void OTG_HS_IRQHandler(void) {
	clearNvicIrqFor(OTG_HS_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_HS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB On The Go HS wake-up interrupt through EXTI line 20 */
void OTG_HS_WKUP_IRQHandler(void) {
	clearNvicIrqFor(OTG_HS_WKUP_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_HS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB On The Go HS global interrupt */
void OTG_IRQHandler(void) {
	clearNvicIrqFor(OTG_IRQn);
	STM32CubeDuinoIrqHandlerForUSB_OTG_HS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** PKA global interrupt */
void PKA_IRQHandler(void) {
	clearNvicIrqFor(PKA_IRQn);
	STM32CubeDuinoIrqHandlerForPKA();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** PVD and AVD interrupt through EXTI line 16 */
void PVD_AVD_IRQHandler(void) {
	clearNvicIrqFor(PVD_AVD_IRQn);
	ifIsPendingIrqForPWR() STM32CubeDuinoIrqHandlerForPWR();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** QUADSPI global interrupt */
void QUADSPI_IRQHandler(void) {
	clearNvicIrqFor(QUADSPI_IRQn);
	STM32CubeDuinoIrqHandlerForQUADSPI();
	STM32CubeDuinoIrqHandlerForQUADSPI1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RCC and CRS global interrupts */
void RCC_CRS_IRQHandler(void) {
	clearNvicIrqFor(RCC_CRS_IRQn);
	STM32CubeDuinoIrqHandlerForRCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RCC non-secure global interrupt */
void RCC_IRQHandler(void) {
	clearNvicIrqFor(RCC_IRQn);
	STM32CubeDuinoIrqHandlerForRCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RCC secure global interrupt */
void RCC_S_IRQHandler(void) {
	clearNvicIrqFor(RCC_S_IRQn);
	STM32CubeDuinoIrqHandlerForRCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RCC wake-up interrupt */
void RCC_WAKEUP_IRQHandler(void) {
	clearNvicIrqFor(RCC_WAKEUP_IRQn);
	STM32CubeDuinoIrqHandlerForRCC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RNG global interrupt */
void RNG_IRQHandler(void) {
	clearNvicIrqFor(RNG_IRQn);
	STM32CubeDuinoIrqHandlerForRNG();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** RNG and LPUART1 Interrupts / LPUART1 wake-up interrupt through EXTI line 28 */
void RNG_LPUART1_IRQHandler(void) {
	clearNvicIrqFor(RNG_LPUART1_IRQn);
	STM32CubeDuinoIrqHandlerForLPUART1();
	STM32CubeDuinoIrqHandlerForRNG();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RNG1 global interrupt */
void RNG1_IRQHandler(void) {
	clearNvicIrqFor(RNG1_IRQn);
	STM32CubeDuinoIrqHandlerForRNG1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RNG2 global interrupt */
void RNG2_IRQHandler(void) {
	clearNvicIrqFor(RNG2_IRQn);
	STM32CubeDuinoIrqHandlerForRNG2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC alarms (A and B) interrupt through EXTI line 17 */
void RTC_Alarm_IRQHandler(void) {
	clearNvicIrqFor(RTC_Alarm_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC global interrupt through EXTI lines 17, 19 and 20 and LSE CSS interrupt through EXTI line 19 */
void RTC_IRQHandler(void) {
	clearNvicIrqFor(RTC_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC secure interrupts through EXTI line 18 */
void RTC_S_IRQHandler(void) {
	clearNvicIrqFor(RTC_S_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC and TAMP interrupts through EXTI lines 19 and 21 */
void RTC_TAMP_IRQHandler(void) {
	clearNvicIrqFor(RTC_TAMP_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC Tamper and TimeStamp and RCC LSE CSS interrupts through the EXTI */
void RTC_TAMP_LSECSS_IRQHandler(void) {
	clearNvicIrqFor(RTC_TAMP_LSECSS_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Tamper, timestamp, CSS and LSE interrupts through EXTI line */
void RTC_TAMP_STAMP_CSS_LSE_IRQHandler(void) {
	clearNvicIrqFor(RTC_TAMP_STAMP_CSS_LSE_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC timestamp interrupt */
void RTC_TIMESTAMP_IRQHandler(void) {
	clearNvicIrqFor(RTC_TIMESTAMP_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC wake-up and alarms (A and B) interrupt */
void RTC_WKUP_ALARM_IRQHandler(void) {
	clearNvicIrqFor(RTC_WKUP_ALARM_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC wake-up interrupt through EXTI line 19 */
void RTC_WKUP_IRQHandler(void) {
	clearNvicIrqFor(RTC_WKUP_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SAI1 global interrupt */
void SAI1_IRQHandler(void) {
	clearNvicIrqFor(SAI1_IRQn);
	STM32CubeDuinoIrqHandlerForSAI1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SAI2 global interrupt */
void SAI2_IRQHandler(void) {
	clearNvicIrqFor(SAI2_IRQn);
	STM32CubeDuinoIrqHandlerForSAI2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SAI3 global interrupt */
void SAI3_IRQHandler(void) {
	clearNvicIrqFor(SAI3_IRQn);
	STM32CubeDuinoIrqHandlerForSAI3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SAI4 global interrupt */
void SAI4_IRQHandler(void) {
	clearNvicIrqFor(SAI4_IRQn);
	STM32CubeDuinoIrqHandlerForSAI4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDADC1 global interrupt */
void SDADC1_IRQHandler(void) {
	clearNvicIrqFor(SDADC1_IRQn);
	STM32CubeDuinoIrqHandlerForSDADC1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDADC2 global interrupt */
void SDADC2_IRQHandler(void) {
	clearNvicIrqFor(SDADC2_IRQn);
	STM32CubeDuinoIrqHandlerForSDADC2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDADC3 global interrupt */
void SDADC3_IRQHandler(void) {
	clearNvicIrqFor(SDADC3_IRQn);
	STM32CubeDuinoIrqHandlerForSDADC3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDIO global interrupt */
void SDIO_IRQHandler(void) {
	clearNvicIrqFor(SDIO_IRQn);
	STM32CubeDuinoIrqHandlerForSDIO();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDMMC1 global interrupt */
void SDMMC1_IRQHandler(void) {
	clearNvicIrqFor(SDMMC1_IRQn);
	STM32CubeDuinoIrqHandlerForSDMMC1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDMMC2 global interrupt */
void SDMMC2_IRQHandler(void) {
	clearNvicIrqFor(SDMMC2_IRQn);
	STM32CubeDuinoIrqHandlerForSDMMC2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SDMMC3 global interrupt */
void SDMMC3_IRQHandler(void) {
	clearNvicIrqFor(SDMMC3_IRQn);
	STM32CubeDuinoIrqHandlerForSDMMC3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPDIF-RX global interrupt */
void SPDIF_RX_IRQHandler(void) {
	clearNvicIrqFor(SPDIF_RX_IRQn);
	STM32CubeDuinoIrqHandlerForSPDIFRX();
	STM32CubeDuinoIrqHandlerForSPDIFRX1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPI1 global interrupt */
void SPI1_IRQHandler(void) {
	clearNvicIrqFor(SPI1_IRQn);
	STM32CubeDuinoIrqHandlerForI2S1();
	ifIsPendingIrqForSPI1() STM32CubeDuinoIrqHandlerForSPI1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPI2 global interrupt */
void SPI2_IRQHandler(void) {
	clearNvicIrqFor(SPI2_IRQn);
	STM32CubeDuinoIrqHandlerForI2S2();
	ifIsPendingIrqForSPI2() STM32CubeDuinoIrqHandlerForSPI2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPI3 global interrupt */
void SPI3_IRQHandler(void) {
	clearNvicIrqFor(SPI3_IRQn);
	STM32CubeDuinoIrqHandlerForI2S3();
	STM32CubeDuinoIrqHandlerForSPI3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPI4 global interrupt */
void SPI4_IRQHandler(void) {
	clearNvicIrqFor(SPI4_IRQn);
	STM32CubeDuinoIrqHandlerForI2S4();
	STM32CubeDuinoIrqHandlerForSPI4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPI5 global interrupt */
void SPI5_IRQHandler(void) {
	clearNvicIrqFor(SPI5_IRQn);
	STM32CubeDuinoIrqHandlerForI2S5();
	STM32CubeDuinoIrqHandlerForSPI5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** SPI6 global interrupt */
void SPI6_IRQHandler(void) {
	clearNvicIrqFor(SPI6_IRQn);
	STM32CubeDuinoIrqHandlerForI2S6();
	STM32CubeDuinoIrqHandlerForSPI6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Serial Wire Interface 1 global interrupt */
void SWPMI1_IRQHandler(void) {
	clearNvicIrqFor(SWPMI1_IRQn);
	STM32CubeDuinoIrqHandlerForSWPMI1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Tamper interrupt */
void TAMPER_IRQHandler(void) {
	clearNvicIrqFor(TAMPER_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC tamper, LSECSS and timestamp interrupts through EXTI line 19 */
void TAMPER_STAMP_IRQHandler(void) {
	clearNvicIrqFor(TAMPER_STAMP_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Tamper non-secure global interrupt through EXTI line 19 */
void TAMP_IRQHandler(void) {
	clearNvicIrqFor(TAMP_IRQn);
	STM32CubeDuinoIrqHandlerForTAMP();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC tamper and time stamp, CSS on LSE interrupts through EXTI line 19 */
void TAMP_STAMP_IRQHandler(void) {
	clearNvicIrqFor(TAMP_STAMP_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** RTC tamper and time stamp, CSS on LSE interrupts through EXTI line 18 */
void TAMP_STAMP_LSECSS_IRQHandler(void) {
	clearNvicIrqFor(TAMP_STAMP_LSECSS_IRQn);
	ifIsPendingIrqForRTC() STM32CubeDuinoIrqHandlerForRTC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Tamper secure global interrupt through EXTI line 20 */
void TAMP_S_IRQHandler(void) {
	clearNvicIrqFor(TAMP_S_IRQn);
	STM32CubeDuinoIrqHandlerForTAMP();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Temperature sensor global Interrupt */
void TEMP_IRQHandler(void) {
	clearNvicIrqFor(TEMP_IRQn);
	STM32CubeDuinoIrqHandlerForTEMPSENS();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 break interrupt */
void TIM1_BRK_IRQHandler(void) {
	clearNvicIrqFor(TIM1_BRK_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 break interrupt and TIM9 global interrupt */
void TIM1_BRK_TIM9_IRQHandler(void) {
	clearNvicIrqFor(TIM1_BRK_TIM9_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
	STM32CubeDuinoIrqHandlerForTIM9();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 break interrupt and TIM15 global interrupt */
void TIM1_BRK_TIM15_IRQHandler(void) {
	clearNvicIrqFor(TIM1_BRK_TIM15_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
	ifIsPendingIrqForTIM15() STM32CubeDuinoIrqHandlerForTIM15();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 break, update, trigger and commutation interrupts */
void TIM1_BRK_UP_TRG_COM_IRQHandler(void) {
	clearNvicIrqFor(TIM1_BRK_UP_TRG_COM_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 capture compare interrupt */
void TIM1_CC_IRQHandler(void) {
	clearNvicIrqFor(TIM1_CC_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 trigger and commutation interrupts */
void TIM1_TRG_COM_IRQHandler(void) {
	clearNvicIrqFor(TIM1_TRG_COM_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 trigger and commutation interrupts and TIM11 global interrupt */
void TIM1_TRG_COM_TIM11_IRQHandler(void) {
	clearNvicIrqFor(TIM1_TRG_COM_TIM11_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
	STM32CubeDuinoIrqHandlerForTIM11();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 trigger and commutation interrupts and TIM17 global interrupt */
void TIM1_TRG_COM_TIM17_IRQHandler(void) {
	clearNvicIrqFor(TIM1_TRG_COM_TIM17_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
	ifIsPendingIrqForTIM17() STM32CubeDuinoIrqHandlerForTIM17();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 update interrupt */
void TIM1_UP_IRQHandler(void) {
	clearNvicIrqFor(TIM1_UP_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 update interrupt and TIM10 global interrupt */
void TIM1_UP_TIM10_IRQHandler(void) {
	clearNvicIrqFor(TIM1_UP_TIM10_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
	STM32CubeDuinoIrqHandlerForTIM10();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM1 update interrupt and TIM16 global interrupt */
void TIM1_UP_TIM16_IRQHandler(void) {
	clearNvicIrqFor(TIM1_UP_TIM16_IRQn);
	ifIsPendingIrqForTIM1() STM32CubeDuinoIrqHandlerForTIM1();
	ifIsPendingIrqForTIM16() STM32CubeDuinoIrqHandlerForTIM16();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM2 global interrupt */
void TIM2_IRQHandler(void) {
	clearNvicIrqFor(TIM2_IRQn);
	ifIsPendingIrqForTIM2() STM32CubeDuinoIrqHandlerForTIM2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM3 global interrupt */
void TIM3_IRQHandler(void) {
	clearNvicIrqFor(TIM3_IRQn);
	ifIsPendingIrqForTIM3() STM32CubeDuinoIrqHandlerForTIM3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM4 global interrupt */
void TIM4_IRQHandler(void) {
	clearNvicIrqFor(TIM4_IRQn);
	STM32CubeDuinoIrqHandlerForTIM4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM5 global interrupt */
void TIM5_IRQHandler(void) {
	clearNvicIrqFor(TIM5_IRQn);
	STM32CubeDuinoIrqHandlerForTIM5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE)) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM6 global interrupt, DAC channel1 and channel2 underrun error interrupts */
void TIM6_DAC_IRQHandler(void) {
	clearNvicIrqFor(TIM6_DAC_IRQn);
	ifIsPendingIrqForDAC() STM32CubeDuinoIrqHandlerForDAC();
	STM32CubeDuinoIrqHandlerForDAC1();
	STM32CubeDuinoIrqHandlerForDAC3();
	ifIsPendingIrqForTIM6() STM32CubeDuinoIrqHandlerForTIM6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE)) || (defined(SCD_ENABLE_TIMER) && (defined(LPTIM_PRESCALER_DIV1) || defined(TIM_CLOCKPRESCALER_DIV1)))
/** TIM6, DAC1 and LPTIM1 interrupts (LPTIM1 interrupt through EXTI line 29) */
void TIM6_DAC_LPTIM1_IRQHandler(void) {
	clearNvicIrqFor(TIM6_DAC_LPTIM1_IRQn);
	STM32CubeDuinoIrqHandlerForDAC1();
	STM32CubeDuinoIrqHandlerForLPTIM1();
	ifIsPendingIrqForTIM6() STM32CubeDuinoIrqHandlerForTIM6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE or LPTIM_PRESCALER_DIV1 or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE)) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM6 global interrupt and DAC1 underrun error interrupts */
void TIM6_DAC1_IRQHandler(void) {
	clearNvicIrqFor(TIM6_DAC1_IRQn);
	STM32CubeDuinoIrqHandlerForDAC1();
	ifIsPendingIrqForTIM6() STM32CubeDuinoIrqHandlerForTIM6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM6 global interrupt */
void TIM6_IRQHandler(void) {
	clearNvicIrqFor(TIM6_IRQn);
	ifIsPendingIrqForTIM6() STM32CubeDuinoIrqHandlerForTIM6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE)) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM7 global interrupt, DAC2 and DAC4 channel underrun error interrupts */
void TIM7_DAC_IRQHandler(void) {
	clearNvicIrqFor(TIM7_DAC_IRQn);
	STM32CubeDuinoIrqHandlerForDAC2();
	STM32CubeDuinoIrqHandlerForDAC4();
	ifIsPendingIrqForTIM7() STM32CubeDuinoIrqHandlerForTIM7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE)) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM7 global and DAC2 underrun error interrupts */
void TIM7_DAC2_IRQHandler(void) {
	clearNvicIrqFor(TIM7_DAC2_IRQn);
	STM32CubeDuinoIrqHandlerForDAC2();
	ifIsPendingIrqForTIM7() STM32CubeDuinoIrqHandlerForTIM7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM7 global interrupt */
void TIM7_IRQHandler(void) {
	clearNvicIrqFor(TIM7_IRQn);
	ifIsPendingIrqForTIM7() STM32CubeDuinoIrqHandlerForTIM7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && (defined(LPTIM_PRESCALER_DIV1) || defined(TIM_CLOCKPRESCALER_DIV1)))
/** TIM7 and LPTIM2 interrupts (LPTIM2 interrupt through EXTI line 30) */
void TIM7_LPTIM2_IRQHandler(void) {
	clearNvicIrqFor(TIM7_LPTIM2_IRQn);
	STM32CubeDuinoIrqHandlerForLPTIM2();
	ifIsPendingIrqForTIM7() STM32CubeDuinoIrqHandlerForTIM7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or LPTIM_PRESCALER_DIV1 or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 break global interrupt */
void TIM8_BRK_IRQHandler(void) {
	clearNvicIrqFor(TIM8_BRK_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 break interrupt and TIM12 global interrupt */
void TIM8_BRK_TIM12_IRQHandler(void) {
	clearNvicIrqFor(TIM8_BRK_TIM12_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
	STM32CubeDuinoIrqHandlerForTIM12();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 capture compare interrupt */
void TIM8_CC_IRQHandler(void) {
	clearNvicIrqFor(TIM8_CC_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 trigger and commutation interrupts */
void TIM8_TRG_COM_IRQHandler(void) {
	clearNvicIrqFor(TIM8_TRG_COM_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 trigger and commutation interrupts and TIM14 global interrupt */
void TIM8_TRG_COM_TIM14_IRQHandler(void) {
	clearNvicIrqFor(TIM8_TRG_COM_TIM14_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
	ifIsPendingIrqForTIM14() STM32CubeDuinoIrqHandlerForTIM14();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 update interrupt */
void TIM8_UP_IRQHandler(void) {
	clearNvicIrqFor(TIM8_UP_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM8 update interrupt and TIM13 global interrupt */
void TIM8_UP_TIM13_IRQHandler(void) {
	clearNvicIrqFor(TIM8_UP_TIM13_IRQn);
	STM32CubeDuinoIrqHandlerForTIM8();
	STM32CubeDuinoIrqHandlerForTIM13();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


