daniel-starke/STM32CubeDuino/src/wiring_irq.cpp
#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM9 global interrupt */
void TIM9_IRQHandler(void) {
	clearNvicIrqFor(TIM9_IRQn);
	STM32CubeDuinoIrqHandlerForTIM9();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM10 global interrupt */
void TIM10_IRQHandler(void) {
	clearNvicIrqFor(TIM10_IRQn);
	STM32CubeDuinoIrqHandlerForTIM10();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM11 global interrupt */
void TIM11_IRQHandler(void) {
	clearNvicIrqFor(TIM11_IRQn);
	STM32CubeDuinoIrqHandlerForTIM11();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM12 global interrupt */
void TIM12_IRQHandler(void) {
	clearNvicIrqFor(TIM12_IRQn);
	STM32CubeDuinoIrqHandlerForTIM12();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM13 global interrupt */
void TIM13_IRQHandler(void) {
	clearNvicIrqFor(TIM13_IRQn);
	STM32CubeDuinoIrqHandlerForTIM13();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM14 global interrupt */
void TIM14_IRQHandler(void) {
	clearNvicIrqFor(TIM14_IRQn);
	ifIsPendingIrqForTIM14() STM32CubeDuinoIrqHandlerForTIM14();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM15 global interrupt */
void TIM15_IRQHandler(void) {
	clearNvicIrqFor(TIM15_IRQn);
	ifIsPendingIrqForTIM15() STM32CubeDuinoIrqHandlerForTIM15();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM16 global interrupt */
void TIM16_IRQHandler(void) {
	clearNvicIrqFor(TIM16_IRQn);
	ifIsPendingIrqForTIM16() STM32CubeDuinoIrqHandlerForTIM16();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM17 global interrupt */
void TIM17_IRQHandler(void) {
	clearNvicIrqFor(TIM17_IRQn);
	ifIsPendingIrqForTIM17() STM32CubeDuinoIrqHandlerForTIM17();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_DAC) && defined(DAC_TRIGGER_NONE)) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM18 global interrupt and DAC2 underrun error interrupt */
void TIM18_DAC2_IRQHandler(void) {
	clearNvicIrqFor(TIM18_DAC2_IRQn);
	STM32CubeDuinoIrqHandlerForDAC2();
	STM32CubeDuinoIrqHandlerForTIM18();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or DAC_TRIGGER_NONE or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM19 global interrupt */
void TIM19_IRQHandler(void) {
	clearNvicIrqFor(TIM19_IRQn);
	STM32CubeDuinoIrqHandlerForTIM19();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM20 break interrupt */
void TIM20_BRK_IRQHandler(void) {
	clearNvicIrqFor(TIM20_BRK_IRQn);
	STM32CubeDuinoIrqHandlerForTIM20();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM20 capture compare interrupt */
void TIM20_CC_IRQHandler(void) {
	clearNvicIrqFor(TIM20_CC_IRQn);
	STM32CubeDuinoIrqHandlerForTIM20();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM20 trigger and commutation interrupts */
void TIM20_TRG_COM_IRQHandler(void) {
	clearNvicIrqFor(TIM20_TRG_COM_IRQn);
	STM32CubeDuinoIrqHandlerForTIM20();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM20 update interrupt */
void TIM20_UP_IRQHandler(void) {
	clearNvicIrqFor(TIM20_UP_IRQn);
	STM32CubeDuinoIrqHandlerForTIM20();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM21 global interrupt */
void TIM21_IRQHandler(void) {
	clearNvicIrqFor(TIM21_IRQn);
	STM32CubeDuinoIrqHandlerForTIM21();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM22 global interrupt */
void TIM22_IRQHandler(void) {
	clearNvicIrqFor(TIM22_IRQn);
	STM32CubeDuinoIrqHandlerForTIM22();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM23 global interrupt */
void TIM23_IRQHandler(void) {
	clearNvicIrqFor(TIM23_IRQn);
	STM32CubeDuinoIrqHandlerForTIM23();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (defined(SCD_ENABLE_TIMER) && defined(TIM_CLOCKPRESCALER_DIV1))
/** TIM24 global interrupt */
void TIM24_IRQHandler(void) {
	clearNvicIrqFor(TIM24_IRQn);
	STM32CubeDuinoIrqHandlerForTIM24();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or TIM_CLOCKPRESCALER_DIV1 */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Touch sensing controller interrupt */
void TSC_IRQHandler(void) {
	clearNvicIrqFor(TSC_IRQn);
	ifIsPendingIrqForTSC() STM32CubeDuinoIrqHandlerForTSC();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** UART4 global interrupt / UART4 wake-up interrupt through EXTI line 29 */
void UART4_IRQHandler(void) {
	clearNvicIrqFor(UART4_IRQn);
	STM32CubeDuinoIrqHandlerForUART4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** UART5 global interrupt / UART5 wake-up interrupt through EXTI line 30 */
void UART5_IRQHandler(void) {
	clearNvicIrqFor(UART5_IRQn);
	STM32CubeDuinoIrqHandlerForUART5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** UART7 global interrupt */
void UART7_IRQHandler(void) {
	clearNvicIrqFor(UART7_IRQn);
	STM32CubeDuinoIrqHandlerForUART7();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** UART8 global interrupt */
void UART8_IRQHandler(void) {
	clearNvicIrqFor(UART8_IRQn);
	STM32CubeDuinoIrqHandlerForUART8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** UART9 global interrupt */
void UART9_IRQHandler(void) {
	clearNvicIrqFor(UART9_IRQn);
	STM32CubeDuinoIrqHandlerForUART9();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** UART10 global interrupt */
void UART10_IRQHandler(void) {
	clearNvicIrqFor(UART10_IRQn);
	STM32CubeDuinoIrqHandlerForUART10();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** UCPD1 interrupt / UCPD1 wake-up interrupt through EXTI line 41 */
void UCPD1_IRQHandler(void) {
	clearNvicIrqFor(UCPD1_IRQn);
	STM32CubeDuinoIrqHandlerForUCPD1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** UCPD1 and UCPD2 interrupts / UCPD1 and UCPD2 wake-up interrupts through EXTI lines 32 and 33 */
void UCPD1_2_IRQHandler(void) {
	clearNvicIrqFor(UCPD1_2_IRQn);
	STM32CubeDuinoIrqHandlerForUCPD1();
	STM32CubeDuinoIrqHandlerForUCPD2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART1 global interrupt / USART1 wake-up interrupt through EXTI line 25 */
void USART1_IRQHandler(void) {
	clearNvicIrqFor(USART1_IRQn);
	ifIsPendingIrqForUSART1() STM32CubeDuinoIrqHandlerForUSART1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART2 global interrupt / USART2 wake-up interrupt through EXTI line 26 */
void USART2_IRQHandler(void) {
	clearNvicIrqFor(USART2_IRQn);
	ifIsPendingIrqForUSART2() STM32CubeDuinoIrqHandlerForUSART2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART3 global interrupt / USART3 wake-up interrupt through EXTI line 28 */
void USART3_IRQHandler(void) {
	clearNvicIrqFor(USART3_IRQn);
	ifIsPendingIrqForUSART3() STM32CubeDuinoIrqHandlerForUSART3();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART3 and USART4 global interrupts */
void USART3_4_IRQHandler(void) {
	clearNvicIrqFor(USART3_4_IRQn);
	ifIsPendingIrqForUSART3() STM32CubeDuinoIrqHandlerForUSART3();
	ifIsPendingIrqForUSART4() STM32CubeDuinoIrqHandlerForUSART4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART3, USART4 and LPUART1 interrupts / LPUART1 wake-up interrupt through EXTI line 28 */
void USART3_4_LPUART1_IRQHandler(void) {
	clearNvicIrqFor(USART3_4_LPUART1_IRQn);
	STM32CubeDuinoIrqHandlerForLPUART1();
	ifIsPendingIrqForUSART3() STM32CubeDuinoIrqHandlerForUSART3();
	ifIsPendingIrqForUSART4() STM32CubeDuinoIrqHandlerForUSART4();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART3 to USART6 global interrupts */
void USART3_6_IRQHandler(void) {
	clearNvicIrqFor(USART3_6_IRQn);
	ifIsPendingIrqForUSART3() STM32CubeDuinoIrqHandlerForUSART3();
	ifIsPendingIrqForUSART4() STM32CubeDuinoIrqHandlerForUSART4();
	ifIsPendingIrqForUSART5() STM32CubeDuinoIrqHandlerForUSART5();
	ifIsPendingIrqForUSART6() STM32CubeDuinoIrqHandlerForUSART6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART3 to USART8 global interrupts / USART3 wake-up interrupt through EXTI line 28 */
void USART3_8_IRQHandler(void) {
	clearNvicIrqFor(USART3_8_IRQn);
	ifIsPendingIrqForUSART3() STM32CubeDuinoIrqHandlerForUSART3();
	ifIsPendingIrqForUSART4() STM32CubeDuinoIrqHandlerForUSART4();
	ifIsPendingIrqForUSART5() STM32CubeDuinoIrqHandlerForUSART5();
	ifIsPendingIrqForUSART6() STM32CubeDuinoIrqHandlerForUSART6();
	ifIsPendingIrqForUSART7() STM32CubeDuinoIrqHandlerForUSART7();
	ifIsPendingIrqForUSART8() STM32CubeDuinoIrqHandlerForUSART8();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART4 and USART5 interrupt */
void USART4_5_IRQHandler(void) {
	clearNvicIrqFor(USART4_5_IRQn);
	ifIsPendingIrqForUSART4() STM32CubeDuinoIrqHandlerForUSART4();
	ifIsPendingIrqForUSART5() STM32CubeDuinoIrqHandlerForUSART5();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART6 global interrupt */
void USART6_IRQHandler(void) {
	clearNvicIrqFor(USART6_IRQn);
	ifIsPendingIrqForUSART6() STM32CubeDuinoIrqHandlerForUSART6();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_SERIAL) && defined(IS_UART_MODE))
/** USART10 global interrupt */
void USART10_IRQHandler(void) {
	clearNvicIrqFor(USART10_IRQn);
	STM32CubeDuinoIrqHandlerForUSART10();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or IS_UART_MODE */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB host EHCI global interrupt */
void USBH_EHCI_IRQHandler(void) {
	clearNvicIrqFor(USBH_EHCI_IRQn);
	STM32CubeDuinoIrqHandlerForUSBH_HS2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** USB host OHCI global interrupt */
void USBH_OHCI_IRQHandler(void) {
	clearNvicIrqFor(USBH_OHCI_IRQn);
	STM32CubeDuinoIrqHandlerForUSBH_HS1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB wake-up interrupt through EXTI line 18 */
void USBWakeUp_IRQHandler(void) {
	clearNvicIrqFor(USBWakeUp_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB wake-up interrupt through EXTI line 18 remap */
void USBWakeUp_RMP_IRQHandler(void) {
	clearNvicIrqFor(USBWakeUp_RMP_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB FS global interrupt / USB FS wake-up interrupt through EXTI line 34 */
void USB_FS_IRQHandler(void) {
	clearNvicIrqFor(USB_FS_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB FS wake-up interrupt through EXTI line 18 */
void USB_FS_WKUP_IRQHandler(void) {
	clearNvicIrqFor(USB_FS_WKUP_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** CAN TX and USB high priority interrupts */
void USB_HP_CAN_TX_IRQHandler(void) {
	clearNvicIrqFor(USB_HP_CAN_TX_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB high priority or CAN TX interrupts */
void USB_HP_CAN1_TX_IRQHandler(void) {
	clearNvicIrqFor(USB_HP_CAN1_TX_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB high priority global interrupt */
void USB_HP_IRQHandler(void) {
	clearNvicIrqFor(USB_HP_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB global interrupt / USB wake-up interrupt through EXTI line 18 */
void USB_IRQHandler(void) {
	clearNvicIrqFor(USB_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** CAN RX0 and USB low priority interrupts */
void USB_LP_CAN_RX0_IRQHandler(void) {
	clearNvicIrqFor(USB_LP_CAN_RX0_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB low priority or CAN RX0 interrupts */
void USB_LP_CAN1_RX0_IRQHandler(void) {
	clearNvicIrqFor(USB_LP_CAN1_RX0_IRQn);
	ifIsPendingIrqForCAN() STM32CubeDuinoIrqHandlerForCAN();
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#if defined(STM32CUBEDUINO_MAP_ALL_IRQS) || (!defined(STM32CUBEDUINO_DISABLE_USB) && defined(PCD_PHY_EMBEDDED))
/** USB low priority interrupt, USB wake-up interrupt through EXTI line 28 */
void USB_LP_IRQHandler(void) {
	clearNvicIrqFor(USB_LP_IRQn);
	STM32CubeDuinoIrqHandlerForUSB();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS or PCD_PHY_EMBEDDED */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Interrupt for all 6 wake-up pins */
void WAKEUP_PIN_IRQHandler(void) {
	clearNvicIrqFor(WAKEUP_PIN_IRQn);
	ifIsPendingIrqForPWR() STM32CubeDuinoIrqHandlerForPWR();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Window watchdog interrupt */
void WWDG_IRQHandler(void) {
	clearNvicIrqFor(WWDG_IRQn);
	ifIsPendingIrqForWWDG() STM32CubeDuinoIrqHandlerForWWDG();
	STM32CubeDuinoIrqHandlerForWWDG1();
	STM32CubeDuinoIrqHandlerForWWDG2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Window watchdog reset interrupt */
void WWDG_RST_IRQHandler(void) {
	clearNvicIrqFor(WWDG_RST_IRQn);
	STM32CubeDuinoIrqHandlerForWWDG1();
	STM32CubeDuinoIrqHandlerForWWDG2();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */


#ifdef STM32CUBEDUINO_MAP_ALL_IRQS
/** Window watchdog interrupt */
void WWDG1_IRQHandler(void) {
	clearNvicIrqFor(WWDG1_IRQn);
	STM32CubeDuinoIrqHandlerForWWDG1();
}
#endif /* STM32CUBEDUINO_MAP_ALL_IRQS */
#endif /* STM32CUBEDUINO_CUSTOM_IRQ_HANDLERS */
} /* extern "C" */
